openCSMP/openCSMP/lib/samg/samg5.h
//****************************************************************************************
// file: samg.h
// automatically created by tool make_amgparms_user
// created on (yyyy-mm-dd): 2014-11-20, time: 13:48
//****************************************************************************************

// INTERFACE TO FORTRAN90 SAMG5 : amg subroutines have
// to be called as SAMG5_SAMG when this interface is used
// author: Tanja Clees
// last modified: 2011/10/11 AK

////////////
/* Macros */
////////////

/* subroutine naming conventions.
for Unix / Linux: depending on the names of the Fortran symbols in libamg.a,
   choose one of the following macros via a -D option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!):
      SAMG_LCASE
      SAMG_LCASE_USCORE   (see below what they do)
   if none of the above matches the naming conventions for your system,
   define appropriate macros yourself!
*/

/* SAMG_C_CALLCONV: macro (for Windows!) defining the standard calling convention.
   for Unix / Linux: set -DSAMG_UNIX_LINUX as an option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!) */

/* Applications uses 8 Byte integers */
#ifdef INTEGER_SIZE_64
#ifdef _WIN32
#define APPL_INT __int64
#else
#define APPL_INT long int
#endif
#endif

/* default 4 Byte integer types */
#ifndef APPL_INT
#define APPL_INT int
#endif

#if SAMG_UNIX_LINUX
#define SAMG_C_CALLCONV void
#elif SAMG_CVF
// for Compaq Visual Fortran (tested with 6.6 X) :
#define SAMG_C_CALLCONV void __stdcall
#else
// for Intel Visual Fortran (tested with 8.X) :
#define SAMG_C_CALLCONV void __cdecl
#endif


/////////////////////////////////////
/* directives for subroutine names */
/////////////////////////////////////

#ifdef SAMG_LCASE
#define SAMG5 samg5
#define SAMG5_CTIME samg5_ctime
#define SAMG5_CPUTIME samg5_cputime
#define SAMG5_ELAPSED_TIME samg5_elapsed_time
#define SAMG5_ALL_ERRORINFO samg5_all_errorinfo
#define SAMG5_SIMPLE samg5_simple
#define SAMG5_MAIN samg5_main
#define SAMG5_LEAVE samg5_leave
#define SAMG5_REFRESH samg5_refresh
#define SAMG5_CLEANUP samg5_cleanup
#define SAMG5_RESET_HIDDEN samg5_reset_hidden
#define SAMG5_GET_COMPLEXITIES samg5_get_complexities
#define SAMG5_GET_NFLAG samg5_get_nflag
#define SAMG5_SET_NFLAG samg5_set_nflag
#define SAMG5_GET_NFLAGO samg5_get_nflago
#define SAMG5_SET_NFLAGO samg5_set_nflago
#define SAMG5_GET_NFLAGP samg5_get_nflagp
#define SAMG5_SET_NFLAGP samg5_set_nflagp
#define SAMG5_GET_NFLAGS samg5_get_nflags
#define SAMG5_SET_NFLAGS samg5_set_nflags
#define SAMG5_GET_LEVELS_CREATED samg5_get_levels_created
#define SAMG5_GET_LEVELS_USED samg5_get_levels_used
#define SAMG5_GET_LEV_SIZES samg5_get_lev_sizes
#define SAMG5_GET_MEM_ACTIVE samg5_get_mem_active
#define SAMG5_GET_TIME_AND_MEM samg5_get_time_and_mem
#define SAMG5_EXTRAPRINT samg5_extraprint
#define SAMG5_FLUSH samg5_flush
#define SAMG5_CVEC_ALLOC samg5_cvec_alloc
#define SAMG5_CVEC_DEALLOC samg5_cvec_dealloc
#define SAMG5_CVEC_SET samg5_cvec_set
#define SAMG5_CVEC_GET samg5_cvec_get
#define SAMG5_PROPOSE_NSYS_ISCALE_IU samg5_propose_nsys_iscale_iu
#define SAMG5_USED_OMP_THREADS samg5_used_omp_threads
#define SAMG5_GET_INNERMAX samg5_get_innermax
#define SAMG5_SET_INNERMAX samg5_set_innermax
#define SAMG5_DRV_SET_INNERMAX samg5_drv5_set_innermax
#define SAMG5_GET_NUM_SMOOTH_VECTORS samg5_get_num_smooth_vectors
#define SAMG5_SMOOTH_VECTOR_INIT samg5_smooth_vector_init
#define SAMG5_SMOOTH_VECTOR_SET samg5_smooth_vector_set
#define SAMG5_SMOOTH_VECTOR_GET samg5_smooth_vector_get
#define SAMG5_GET_NUM_DEFLATION_VECTORS samg5_get_num_deflation_vectors
#define SAMG5_DEFLATION_VECTOR_INIT samg5_deflation_vector_init
#define SAMG5_DEFLATION_VECTOR_SET samg5_deflation_vector_set
#define SAMG5_DEFLATION_VECTOR_GET samg5_deflation_vector_get
#define SAMG5_USER_CHECK samg5_user_check
#define SAMG5_USER_SOLVE samg5_user_solve
#define SAMG5_USER_CLEANUP samg5_user_cleanup
#define SAMG5_ARRAY_OFFSET samg5_array_offset
#define SAMG5_PERFINIT samg5_perfinit
#define SAMG5_PERFOUT samg5_perfout
#define SAMG5_PARALLEL_LIB samg5_parallel_lib
#define SAMG5_MEM_INFO samg5_mem_info
#define SAMG5_LRATIO samg5_lratio
#define SAMG5_ADDTIME samg5_addtime
#define SAMG5_COMPTIME samg5_comptime
#define SAMG5_COPY_GALERKIN samg5_copy_galerkin
#define SAMG5_OMEGA_JACOBI_ALLOC samg5_omega_jacobi_alloc
#define SAMG5_OMEGA_JACOBI_DEALLOC samg5_omega_jacobi_dealloc
#define SAMG5_OMEGA_JACOBI_SET samg5_omega_jacobi_set
#define SAMG5_CURRENT_RESIDUAL samg5_current_residual
#define SAMG5_OPEN_LOGFILE samg5_open_logfile
#define SAMG5_CLOSE_LOGFILE samg5_close_logfile
#define SAMG5_COO_VEC_SET samg5_coo_vec_set
#define SAMG5_COO_VEC_ALLOC samg5_coo_vec_alloc
#define SAMG5_COO_VEC_DEALLOC samg5_coo_vec_dealloc
#define SAMG5_IDEC samg5_idec
#define SAMG5_DC samg5_dc
#define XSAMG5 xsamg5
#define XSAMG5_DC xsamg5_dc
#define XSAMG5_START xsamg5_start
#define XSAMG5_START_LINUX xsamg5_start_linux
#define XSAMG5_USER_CTRL xsamg5_user_ctrl
#define XSAMG5_START_IUM xsamg5_start_ium
#define XSAMG5_START_SOLVER xsamg5_start_solver
#define XSAMG5_END_SOLVER xsamg5_end_solver
#define XSAMG5_FINALIZE xsamg5_finalize
#define XSAMG5_END xsamg5_end
#define XSAMG5_GET_LOGIO xsamg5_get_logio
#define XSAMG5_GET_SLAVE_RETURNCODE xsamg5_get_slave_returncode
#define XSAMG5_PROCESS_INFO xsamg5_process_info
#define XSAMG5_GET_INTERNAL_TIMER xsamg5_get_internal_timer
#define XSAMG5_MPI_INIT xsamg5_mpi_init
#define XSAMG5_MPI_FINALIZE xsamg5_mpi_finalize
#define XSAMG5_MPI_COMM_RANK xsamg5_mpi_comm_rank
#define XSAMG5_GET_MPI_COMM_WORLD xsamg5_get_mpi_comm_world
#define XSAMG5_GET_PARALLEL_RUN xsamg5_get_parallel_run
#define XSAMG5_IO_SETTINGS xsamg5_io_settings
#define XSAMG5_IO_SETTINGS2 xsamg5_io_settings2
#define XSAMG5_LAST_MSG xsamg5_last_msg
#define XSAMG5_READ_CONFIG xsamg5_read_config
#define XSAMG5_PRINT_INTERNAL_TIMER xsamg5_print_internal_timer
#define XSAMG5_ERROR_INFO xsamg5_error_info
#define XSAMG5_GET_IERR_ON_TAG_STOP xsamg5_get_ierr_on_tag_stop
#define XSAMG5_CONFIGFILE_MISSING xsamg5_configfile_missing
#define XSAMG5_LEAVE xsamg5_leave
#define XSAMG5_CLEANUP xsamg5_cleanup
#define SAMG5_DUMP_SEQUENCE_RESET samg5_dump_sequence_reset
#define SAMG5_GET_RESIDUAL_VECTOR_E samg5_get_residual_vector_e
#define SAMG5_GET_RESIDUAL_VECTOR_V samg5_get_residual_vector_v
#define SAMG5_RESIDUAL_VECTOR_LEAVE samg5_residual_vector_leave
#define SAMG5_SET_RESIDUAL_VECTOR_E samg5_set_residual_vector_e
#define SAMG5_SET_RESIDUAL_VECTOR_V samg5_set_residual_vector_v
#define SAMG5_SET_RESIDUAL_VECTOR_INIT samg5_set_residual_vector_init
#define XSAMG5_OIL xsamg5_oil
#define SAMG5_OIL samg5_oil
#define SAMG5_SET_RENUMBER_VEC samg5_set_renumber_vec
#define SAMG5_GET_RENUMBER_VEC samg5_get_renumber_vec
#define SAMG5_GETRE_NU samg5_getre_nu
#define SAMG5_GETDBLE_NU samg5_getdble_nu
#define SAMG5_GETINT_NU samg5_getint_nu
#define SAMG5_GETTE_NU samg5_gette_nu
#define SAMG5_GETLO_NU samg5_getlo_nu
#define SAMG5_GETSPEC_NU samg5_getspec_nu
#define SAMG5_SET_A_CMPLX_AGG_DEFAULT samg5_set_a_cmplx_agg_default
#define SAMG5_GET_A_CMPLX_AGG_DEFAULT samg5_get_a_cmplx_agg_default
#define SAMG5_SET_A_CMPLX_DEFAULT samg5_set_a_cmplx_default
#define SAMG5_GET_A_CMPLX_DEFAULT samg5_get_a_cmplx_default
#define SAMG5_SET_ALLOW_FILNAM_IN samg5_set_allow_filnam_in
#define SAMG5_GET_ALLOW_FILNAM_IN samg5_get_allow_filnam_in
#define SAMG5_SET_ALLOW_PRIVATE_IN samg5_set_allow_private_in
#define SAMG5_GET_ALLOW_PRIVATE_IN samg5_get_allow_private_in
#define SAMG5_SET_ALLOW_ELIM samg5_set_allow_elim
#define SAMG5_GET_ALLOW_ELIM samg5_get_allow_elim
#define SAMG5_SET_ALLUNS_AT_ALLPNTS samg5_set_alluns_at_allpnts
#define SAMG5_GET_ALLUNS_AT_ALLPNTS samg5_get_alluns_at_allpnts
#define SAMG5_SET_ART_TIME samg5_set_art_time
#define SAMG5_GET_ART_TIME samg5_get_art_time
#define SAMG5_SET_ART_TIME_CYC samg5_set_art_time_cyc
#define SAMG5_GET_ART_TIME_CYC samg5_get_art_time_cyc
#define SAMG5_SET_ART_TIME_CYC_2ND samg5_set_art_time_cyc_2nd
#define SAMG5_GET_ART_TIME_CYC_2ND samg5_get_art_time_cyc_2nd
#define SAMG5_SET_ART_TIME_SETUP samg5_set_art_time_setup
#define SAMG5_GET_ART_TIME_SETUP samg5_get_art_time_setup
#define SAMG5_SET_ART_TIME_SETUP_2ND samg5_set_art_time_setup_2nd
#define SAMG5_GET_ART_TIME_SETUP_2ND samg5_get_art_time_setup_2nd
#define SAMG5_SET_B_CMPLX samg5_set_b_cmplx
#define SAMG5_GET_B_CMPLX samg5_get_b_cmplx
#define SAMG5_SET_B_CMPLX_AGG_DEFAULT samg5_set_b_cmplx_agg_default
#define SAMG5_GET_B_CMPLX_AGG_DEFAULT samg5_get_b_cmplx_agg_default
#define SAMG5_SET_B_CMPLX_DEFAULT samg5_set_b_cmplx_default
#define SAMG5_GET_B_CMPLX_DEFAULT samg5_get_b_cmplx_default
#define SAMG5_SET_BACKUP samg5_set_backup
#define SAMG5_GET_BACKUP samg5_get_backup
#define SAMG5_SET_BLK_FILLEXP samg5_set_blk_fillexp
#define SAMG5_GET_BLK_FILLEXP samg5_get_blk_fillexp
#define SAMG5_SET_BLK_STAB samg5_set_blk_stab
#define SAMG5_GET_BLK_STAB samg5_get_blk_stab
#define SAMG5_SET_BLOCK_SCALE samg5_set_block_scale
#define SAMG5_GET_BLOCK_SCALE samg5_get_block_scale
#define SAMG5_SET_BLOCK_SCALE2 samg5_set_block_scale2
#define SAMG5_GET_BLOCK_SCALE2 samg5_get_block_scale2
#define SAMG5_SET_BLOCK_SCALE3 samg5_set_block_scale3
#define SAMG5_GET_BLOCK_SCALE3 samg5_get_block_scale3
#define SAMG5_SET_BS_AUTO_SIGN samg5_set_bs_auto_sign
#define SAMG5_GET_BS_AUTO_SIGN samg5_get_bs_auto_sign
#define SAMG5_SET_BS_MIN_BLOCK_SIZE samg5_set_bs_min_block_size
#define SAMG5_GET_BS_MIN_BLOCK_SIZE samg5_get_bs_min_block_size
#define SAMG5_SET_BS_OMP samg5_set_bs_omp
#define SAMG5_GET_BS_OMP samg5_get_bs_omp
#define SAMG5_ISET_BND_PARTITION_FILE samg5_iset_bnd_partition_file
#define SAMG5_IGET_BND_PARTITION_FILE samg5_iget_bnd_partition_file
#define SAMG5_SET_BND_PARTITION_FILE samg5_set_bnd_partition_file
#define SAMG5_GET_BND_PARTITION_FILE samg5_get_bnd_partition_file
#define SAMG5_SET_CHECK_ALLPNTS samg5_set_check_allpnts
#define SAMG5_GET_CHECK_ALLPNTS samg5_get_check_allpnts
#define SAMG5_SET_CHECK_ORDER samg5_set_check_order
#define SAMG5_GET_CHECK_ORDER samg5_get_check_order
#define SAMG5_SET_CHECK_BCSR_DUMP samg5_set_check_bcsr_dump
#define SAMG5_GET_CHECK_BCSR_DUMP samg5_get_check_bcsr_dump
#define SAMG5_SET_CL_CPL samg5_set_cl_cpl
#define SAMG5_GET_CL_CPL samg5_get_cl_cpl
#define SAMG5_SET_CL_ORDER samg5_set_cl_order
#define SAMG5_GET_CL_ORDER samg5_get_cl_order
#define SAMG5_SET_CL_OUTRES samg5_set_cl_outres
#define SAMG5_GET_CL_OUTRES samg5_get_cl_outres
#define SAMG5_SET_CL_LEVEL_DEP samg5_set_cl_level_dep
#define SAMG5_GET_CL_LEVEL_DEP samg5_get_cl_level_dep
#define SAMG5_SET_CL_AUTO_SIZE samg5_set_cl_auto_size
#define SAMG5_GET_CL_AUTO_SIZE samg5_get_cl_auto_size
#define SAMG5_SET_CL_PROC_BORDER samg5_set_cl_proc_border
#define SAMG5_GET_CL_PROC_BORDER samg5_get_cl_proc_border
#define SAMG5_SET_CL_QUALITY_MEASURE samg5_set_cl_quality_measure
#define SAMG5_GET_CL_QUALITY_MEASURE samg5_get_cl_quality_measure
#define SAMG5_SET_CL_GLOBAL_QUALITY samg5_set_cl_global_quality
#define SAMG5_GET_CL_GLOBAL_QUALITY samg5_get_cl_global_quality
#define SAMG5_SET_CL_OMP samg5_set_cl_omp
#define SAMG5_GET_CL_OMP samg5_get_cl_omp
#define SAMG5_SET_CL_CMK_REORDER samg5_set_cl_cmk_reorder
#define SAMG5_GET_CL_CMK_REORDER samg5_get_cl_cmk_reorder
#define SAMG5_SET_CLSOLVER_FINEST samg5_set_clsolver_finest
#define SAMG5_GET_CLSOLVER_FINEST samg5_get_clsolver_finest
#define SAMG5_SET_CLDENSE_CTRL samg5_set_cldense_ctrl
#define SAMG5_GET_CLDENSE_CTRL samg5_get_cldense_ctrl
#define SAMG5_SET_CONST_INT_GLK samg5_set_const_int_glk
#define SAMG5_GET_CONST_INT_GLK samg5_get_const_int_glk
#define SAMG5_SET_CONST_INT_SOL samg5_set_const_int_sol
#define SAMG5_GET_CONST_INT_SOL samg5_get_const_int_sol
#define SAMG5_SET_CNTRL_ENFORCE samg5_set_cntrl_enforce
#define SAMG5_GET_CNTRL_ENFORCE samg5_get_cntrl_enforce
#define SAMG5_SET_CNTRL_LOGFILE samg5_set_cntrl_logfile
#define SAMG5_GET_CNTRL_LOGFILE samg5_get_cntrl_logfile
#define SAMG5_SET_CNTRL_METHOD samg5_set_cntrl_method
#define SAMG5_GET_CNTRL_METHOD samg5_get_cntrl_method
#define SAMG5_SET_CNTRL_RELEASE samg5_set_cntrl_release
#define SAMG5_GET_CNTRL_RELEASE samg5_get_cntrl_release
#define SAMG5_SET_CNTRL_RES_DIFF samg5_set_cntrl_res_diff
#define SAMG5_GET_CNTRL_RES_DIFF samg5_get_cntrl_res_diff
#define SAMG5_SET_CNTRL_RETRY_ITER samg5_set_cntrl_retry_iter
#define SAMG5_GET_CNTRL_RETRY_ITER samg5_get_cntrl_retry_iter
#define SAMG5_SET_CNTRL_STEADY samg5_set_cntrl_steady
#define SAMG5_GET_CNTRL_STEADY samg5_get_cntrl_steady
#define SAMG5_SET_CONV_STOP samg5_set_conv_stop
#define SAMG5_GET_CONV_STOP samg5_get_conv_stop
#define SAMG5_SET_CORRECT_CLUSTER_INFO samg5_set_correct_cluster_info
#define SAMG5_GET_CORRECT_CLUSTER_INFO samg5_get_correct_cluster_info
#define SAMG5_SET_CSET_LASTPNT samg5_set_cset_lastpnt
#define SAMG5_GET_CSET_LASTPNT samg5_get_cset_lastpnt
#define SAMG5_SET_CSET_LESSVARS samg5_set_cset_lessvars
#define SAMG5_GET_CSET_LESSVARS samg5_get_cset_lessvars
#define SAMG5_SET_CSET_LONGROW samg5_set_cset_longrow
#define SAMG5_GET_CSET_LONGROW samg5_get_cset_longrow
#define SAMG5_ISET_CSET_READ samg5_iset_cset_read
#define SAMG5_IGET_CSET_READ samg5_iget_cset_read
#define SAMG5_SET_CSET_READ samg5_set_cset_read
#define SAMG5_GET_CSET_READ samg5_get_cset_read
#define SAMG5_SET_CSET_ZERODIAG samg5_set_cset_zerodiag
#define SAMG5_GET_CSET_ZERODIAG samg5_get_cset_zerodiag
#define SAMG5_SET_CSET_UNKNOWN samg5_set_cset_unknown
#define SAMG5_GET_CSET_UNKNOWN samg5_get_cset_unknown
#define SAMG5_SET_CSET_UNKNOWN1 samg5_set_cset_unknown1
#define SAMG5_GET_CSET_UNKNOWN1 samg5_get_cset_unknown1
#define SAMG5_SET_CSET_UNKNOWN2 samg5_set_cset_unknown2
#define SAMG5_GET_CSET_UNKNOWN2 samg5_get_cset_unknown2
#define SAMG5_SET_DELTA_MILU samg5_set_delta_milu
#define SAMG5_GET_DELTA_MILU samg5_get_delta_milu
#define SAMG5_SET_DENSX samg5_set_densx
#define SAMG5_GET_DENSX samg5_get_densx
#define SAMG5_SET_DIVERGENCE samg5_set_divergence
#define SAMG5_GET_DIVERGENCE samg5_get_divergence
#define SAMG5_SET_DIV_STOP_RULE samg5_set_div_stop_rule
#define SAMG5_GET_DIV_STOP_RULE samg5_get_div_stop_rule
#define SAMG5_SET_DIV_THRESHOLD samg5_set_div_threshold
#define SAMG5_GET_DIV_THRESHOLD samg5_get_div_threshold
#define SAMG5_SET_DROPTOL samg5_set_droptol
#define SAMG5_GET_DROPTOL samg5_get_droptol
#define SAMG5_SET_DROPTOL_CL samg5_set_droptol_cl
#define SAMG5_GET_DROPTOL_CL samg5_get_droptol_cl
#define SAMG5_SET_DROPTOL_2ND samg5_set_droptol_2nd
#define SAMG5_GET_DROPTOL_2ND samg5_get_droptol_2nd
#define SAMG5_SET_DROPTOL_SMO samg5_set_droptol_smo
#define SAMG5_GET_DROPTOL_SMO samg5_get_droptol_smo
#define SAMG5_SET_DUMP_APPROX_SOLUTION samg5_set_dump_approx_solution
#define SAMG5_GET_DUMP_APPROX_SOLUTION samg5_get_dump_approx_solution
#define SAMG5_SET_DUMP_CORRECTW samg5_set_dump_correctw
#define SAMG5_GET_DUMP_CORRECTW samg5_get_dump_correctw
#define SAMG5_SET_DUMP_GENERATED_SMOVEC samg5_set_dump_generated_smovec
#define SAMG5_GET_DUMP_GENERATED_SMOVEC samg5_get_dump_generated_smovec
#define SAMG5_SET_ECG samg5_set_ecg
#define SAMG5_GET_ECG samg5_get_ecg
#define SAMG5_SET_ECG_DEFAULT samg5_set_ecg_default
#define SAMG5_GET_ECG_DEFAULT samg5_get_ecg_default
#define SAMG5_SET_ICHOLESKY samg5_set_icholesky
#define SAMG5_GET_ICHOLESKY samg5_get_icholesky
#define SAMG5_SET_ENFORCE_FULLSMO samg5_set_enforce_fullsmo
#define SAMG5_GET_ENFORCE_FULLSMO samg5_get_enforce_fullsmo
#define SAMG5_SET_EPS_ABS samg5_set_eps_abs
#define SAMG5_GET_EPS_ABS samg5_get_eps_abs
#define SAMG5_SET_EPS_ACCEPT_JAC_UZAWA samg5_set_eps_accept_jac_uzawa
#define SAMG5_GET_EPS_ACCEPT_JAC_UZAWA samg5_get_eps_accept_jac_uzawa
#define SAMG5_SET_EPS_CONVERG_JAC_UZAWA samg5_set_eps_converg_jac_uzawa
#define SAMG5_GET_EPS_CONVERG_JAC_UZAWA samg5_get_eps_converg_jac_uzawa
#define SAMG5_SET_EPS_DD samg5_set_eps_dd
#define SAMG5_GET_EPS_DD samg5_get_eps_dd
#define SAMG5_SET_EPS_DIVERG_JAC_UZAWA samg5_set_eps_diverg_jac_uzawa
#define SAMG5_GET_EPS_DIVERG_JAC_UZAWA samg5_get_eps_diverg_jac_uzawa
#define SAMG5_SET_EPS_DIAG samg5_set_eps_diag
#define SAMG5_GET_EPS_DIAG samg5_get_eps_diag
#define SAMG5_SET_EPS_LSQ samg5_set_eps_lsq
#define SAMG5_GET_EPS_LSQ samg5_get_eps_lsq
#define SAMG5_SET_ETR samg5_set_etr
#define SAMG5_GET_ETR samg5_get_etr
#define SAMG5_SET_ETR_DEFAULT samg5_set_etr_default
#define SAMG5_GET_ETR_DEFAULT samg5_get_etr_default
#define SAMG5_SET_ETR2_SMO samg5_set_etr2_smo
#define SAMG5_GET_ETR2_SMO samg5_get_etr2_smo
#define SAMG5_SET_EWT samg5_set_ewt
#define SAMG5_GET_EWT samg5_get_ewt
#define SAMG5_SET_EWT_DEFAULT samg5_set_ewt_default
#define SAMG5_GET_EWT_DEFAULT samg5_get_ewt_default
#define SAMG5_SET_FACTOR_APP_VAR samg5_set_factor_app_var
#define SAMG5_GET_FACTOR_APP_VAR samg5_get_factor_app_var
#define SAMG5_SET_FACTOR_QUASI_RES samg5_set_factor_quasi_res
#define SAMG5_GET_FACTOR_QUASI_RES samg5_get_factor_quasi_res
#define SAMG5_SET_FACTOR_RES_VAR samg5_set_factor_res_var
#define SAMG5_GET_FACTOR_RES_VAR samg5_get_factor_res_var
#define SAMG5_SET_FACTOR_MATRIX_SCALE samg5_set_factor_matrix_scale
#define SAMG5_GET_FACTOR_MATRIX_SCALE samg5_get_factor_matrix_scale
#define SAMG5_SET_FACTOR_SOL_JAC_UZAWA samg5_set_factor_sol_jac_uzawa
#define SAMG5_GET_FACTOR_SOL_JAC_UZAWA samg5_get_factor_sol_jac_uzawa
#define SAMG5_ISET_FILNAM samg5_iset_filnam
#define SAMG5_IGET_FILNAM samg5_iget_filnam
#define SAMG5_SET_FILNAM samg5_set_filnam
#define SAMG5_GET_FILNAM samg5_get_filnam
#define SAMG5_ISET_FILNAM_DUMPSOL samg5_iset_filnam_dumpsol
#define SAMG5_IGET_FILNAM_DUMPSOL samg5_iget_filnam_dumpsol
#define SAMG5_SET_FILNAM_DUMPSOL samg5_set_filnam_dumpsol
#define SAMG5_GET_FILNAM_DUMPSOL samg5_get_filnam_dumpsol
#define SAMG5_ISET_FILNAM_DUMP samg5_iset_filnam_dump
#define SAMG5_IGET_FILNAM_DUMP samg5_iget_filnam_dump
#define SAMG5_SET_FILNAM_DUMP samg5_set_filnam_dump
#define SAMG5_GET_FILNAM_DUMP samg5_get_filnam_dump
#define SAMG5_ISET_FILNAM_UZAWA samg5_iset_filnam_uzawa
#define SAMG5_IGET_FILNAM_UZAWA samg5_iget_filnam_uzawa
#define SAMG5_SET_FILNAM_UZAWA samg5_set_filnam_uzawa
#define SAMG5_GET_FILNAM_UZAWA samg5_get_filnam_uzawa
#define SAMG5_SET_FLEX_PCG_LITE samg5_set_flex_pcg_lite
#define SAMG5_GET_FLEX_PCG_LITE samg5_get_flex_pcg_lite
#define SAMG5_SET_FORCE_ACCEL samg5_set_force_accel
#define SAMG5_GET_FORCE_ACCEL samg5_get_force_accel
#define SAMG5_SET_FORCE_ACCEL_2ND samg5_set_force_accel_2nd
#define SAMG5_GET_FORCE_ACCEL_2ND samg5_get_force_accel_2nd
#define SAMG5_SET_FULL_PIVOTING samg5_set_full_pivoting
#define SAMG5_GET_FULL_PIVOTING samg5_get_full_pivoting
#define SAMG5_SET_FULL_SETUP samg5_set_full_setup
#define SAMG5_GET_FULL_SETUP samg5_get_full_setup
#define SAMG5_SET_G_CMPLX_AGG_DEFAULT samg5_set_g_cmplx_agg_default
#define SAMG5_GET_G_CMPLX_AGG_DEFAULT samg5_get_g_cmplx_agg_default
#define SAMG5_SET_G_CMPLX_DEFAULT samg5_set_g_cmplx_default
#define SAMG5_GET_G_CMPLX_DEFAULT samg5_get_g_cmplx_default
#define SAMG5_SET_GALERKIN_TIMER samg5_set_galerkin_timer
#define SAMG5_GET_GALERKIN_TIMER samg5_get_galerkin_timer
#define SAMG5_SET_GLK_MULT_ZEROS samg5_set_glk_mult_zeros
#define SAMG5_GET_GLK_MULT_ZEROS samg5_get_glk_mult_zeros
#define SAMG5_SET_GMAX_MULTIPASS samg5_set_gmax_multipass
#define SAMG5_GET_GMAX_MULTIPASS samg5_get_gmax_multipass
#define SAMG5_SET_IAGGREGATION_PROFILE samg5_set_iaggregation_profile
#define SAMG5_GET_IAGGREGATION_PROFILE samg5_get_iaggregation_profile
#define SAMG5_SET_IAGGREGATION samg5_set_iaggregation
#define SAMG5_GET_IAGGREGATION samg5_get_iaggregation
#define SAMG5_SET_IALL_SMO samg5_set_iall_smo
#define SAMG5_GET_IALL_SMO samg5_get_iall_smo
#define SAMG5_SET_IAUTO_OMEGA_JACOBI samg5_set_iauto_omega_jacobi
#define SAMG5_GET_IAUTO_OMEGA_JACOBI samg5_get_iauto_omega_jacobi
#define SAMG5_SET_IAUTO_OMEGA_SMOAGG samg5_set_iauto_omega_smoagg
#define SAMG5_GET_IAUTO_OMEGA_SMOAGG samg5_get_iauto_omega_smoagg
#define SAMG5_SET_IAUTO_STOP samg5_set_iauto_stop
#define SAMG5_GET_IAUTO_STOP samg5_get_iauto_stop
#define SAMG5_SET_IDUMP_SEQUENCE_START samg5_set_idump_sequence_start
#define SAMG5_GET_IDUMP_SEQUENCE_START samg5_get_idump_sequence_start
#define SAMG5_SET_IDUMP_SEQUENCE_END samg5_set_idump_sequence_end
#define SAMG5_GET_IDUMP_SEQUENCE_END samg5_get_idump_sequence_end
#define SAMG5_SET_ISTAB_CG samg5_set_istab_cg
#define SAMG5_GET_ISTAB_CG samg5_get_istab_cg
#define SAMG5_SET_IELASTICITY_PROFILE samg5_set_ielasticity_profile
#define SAMG5_GET_IELASTICITY_PROFILE samg5_get_ielasticity_profile
#define SAMG5_SET_IELASTICITY samg5_set_ielasticity
#define SAMG5_GET_IELASTICITY samg5_get_ielasticity
#define SAMG5_SET_IESTIM_SPECT_RADIUS samg5_set_iestim_spect_radius
#define SAMG5_GET_IESTIM_SPECT_RADIUS samg5_get_iestim_spect_radius
#define SAMG5_SET_IESTIM_SMOOTH_NIT samg5_set_iestim_smooth_nit
#define SAMG5_GET_IESTIM_SMOOTH_NIT samg5_get_iestim_smooth_nit
#define SAMG5_SET_INIT_RES_TREATMENT samg5_set_init_res_treatment
#define SAMG5_GET_INIT_RES_TREATMENT samg5_get_init_res_treatment
#define SAMG5_SET_IPRNT_RES_ACCURACY samg5_set_iprnt_res_accuracy
#define SAMG5_GET_IPRNT_RES_ACCURACY samg5_get_iprnt_res_accuracy
#define SAMG5_SET_ISMO2DFL samg5_set_ismo2dfl
#define SAMG5_GET_ISMO2DFL samg5_get_ismo2dfl
#define SAMG5_SET_ISMOAGG_AGGRESSIVE samg5_set_ismoagg_aggressive
#define SAMG5_GET_ISMOAGG_AGGRESSIVE samg5_get_ismoagg_aggressive
#define SAMG5_SET_ISMOAGG_OVERCORRECTION samg5_set_ismoagg_overcorrection
#define SAMG5_GET_ISMOAGG_OVERCORRECTION samg5_get_ismoagg_overcorrection
#define SAMG5_SET_ISMOAGG_OPTIM samg5_set_ismoagg_optim
#define SAMG5_GET_ISMOAGG_OPTIM samg5_get_ismoagg_optim
#define SAMG5_SET_ISMOAGG_BLOCK_TYP samg5_set_ismoagg_block_typ
#define SAMG5_GET_ISMOAGG_BLOCK_TYP samg5_get_ismoagg_block_typ
#define SAMG5_SET_ISMOAGG_COMPRESSION samg5_set_ismoagg_compression
#define SAMG5_GET_ISMOAGG_COMPRESSION samg5_get_ismoagg_compression
#define SAMG5_SET_ISMOAGG_FILTER_TYP samg5_set_ismoagg_filter_typ
#define SAMG5_GET_ISMOAGG_FILTER_TYP samg5_get_ismoagg_filter_typ
#define SAMG5_SET_ISMOAGG_SMOOTH_TYP samg5_set_ismoagg_smooth_typ
#define SAMG5_GET_ISMOAGG_SMOOTH_TYP samg5_get_ismoagg_smooth_typ
#define SAMG5_SET_ISMOAGG_SMOOTH_NIT samg5_set_ismoagg_smooth_nit
#define SAMG5_GET_ISMOAGG_SMOOTH_NIT samg5_get_ismoagg_smooth_nit
#define SAMG5_SET_ISMOAGG_SMOOTH_1LEV samg5_set_ismoagg_smooth_1lev
#define SAMG5_GET_ISMOAGG_SMOOTH_1LEV samg5_get_ismoagg_smooth_1lev
#define SAMG5_SET_ISMOAGG_SMOOTH_NLEV samg5_set_ismoagg_smooth_nlev
#define SAMG5_GET_ISMOAGG_SMOOTH_NLEV samg5_get_ismoagg_smooth_nlev
#define SAMG5_SET_IB_CMPLX samg5_set_ib_cmplx
#define SAMG5_GET_IB_CMPLX samg5_get_ib_cmplx
#define SAMG5_SET_IB_CMPLX_AGG_DEFAULT samg5_set_ib_cmplx_agg_default
#define SAMG5_GET_IB_CMPLX_AGG_DEFAULT samg5_get_ib_cmplx_agg_default
#define SAMG5_SET_IB_CMPLX_DEFAULT samg5_set_ib_cmplx_default
#define SAMG5_GET_IB_CMPLX_DEFAULT samg5_get_ib_cmplx_default
#define SAMG5_SET_IBGS_PIVOT samg5_set_ibgs_pivot
#define SAMG5_GET_IBGS_PIVOT samg5_get_ibgs_pivot
#define SAMG5_SET_ICASE_JAC_UZAWA samg5_set_icase_jac_uzawa
#define SAMG5_GET_ICASE_JAC_UZAWA samg5_get_icase_jac_uzawa
#define SAMG5_SET_ISTATISTICS_SMOVEC samg5_set_istatistics_smovec
#define SAMG5_GET_ISTATISTICS_SMOVEC samg5_get_istatistics_smovec
#define SAMG5_SET_ICHECK_SMOINT samg5_set_icheck_smoint
#define SAMG5_GET_ICHECK_SMOINT samg5_get_icheck_smoint
#define SAMG5_SET_ICOLOR_OMP samg5_set_icolor_omp
#define SAMG5_GET_ICOLOR_OMP samg5_get_icolor_omp
#define SAMG5_SET_IORDERED_OMP samg5_set_iordered_omp
#define SAMG5_GET_IORDERED_OMP samg5_get_iordered_omp
#define SAMG5_SET_ICRITS samg5_set_icrits
#define SAMG5_GET_ICRITS samg5_get_icrits
#define SAMG5_SET_IDTEST_UZAWA samg5_set_idtest_uzawa
#define SAMG5_GET_IDTEST_UZAWA samg5_get_idtest_uzawa
#define SAMG5_SET_IHUGE samg5_set_ihuge
#define SAMG5_GET_IHUGE samg5_get_ihuge
#define SAMG5_SET_IJAC_UZAWA samg5_set_ijac_uzawa
#define SAMG5_GET_IJAC_UZAWA samg5_get_ijac_uzawa
#define SAMG5_SET_ILU4ALLSCHWARZ samg5_set_ilu4allschwarz
