openCSMP/openCSMP/lib/samg/samg5.h
#define SAMG5_GET_ILU4ALLSCHWARZ samg5_get_ilu4allschwarz
#define SAMG5_SET_ILU_SPEED samg5_set_ilu_speed
#define SAMG5_GET_ILU_SPEED samg5_get_ilu_speed
#define SAMG5_SET_IMPLDO_READ_WRITE_LEN samg5_set_impldo_read_write_len
#define SAMG5_GET_IMPLDO_READ_WRITE_LEN samg5_get_impldo_read_write_len
#define SAMG5_SET_INFO_KEEPMEM samg5_set_info_keepmem
#define SAMG5_GET_INFO_KEEPMEM samg5_get_info_keepmem
#define SAMG5_SET_INNER_ACCEL samg5_set_inner_accel
#define SAMG5_GET_INNER_ACCEL samg5_get_inner_accel
#define SAMG5_SET_IODUMP samg5_set_iodump
#define SAMG5_GET_IODUMP samg5_get_iodump
#define SAMG5_ISET_IOFILE_OPTA samg5_iset_iofile_opta
#define SAMG5_IGET_IOFILE_OPTA samg5_iget_iofile_opta
#define SAMG5_SET_IOFILE_OPTA samg5_set_iofile_opta
#define SAMG5_GET_IOFILE_OPTA samg5_get_iofile_opta
#define SAMG5_ISET_IOFORM samg5_iset_ioform
#define SAMG5_IGET_IOFORM samg5_iget_ioform
#define SAMG5_SET_IOFORM samg5_set_ioform
#define SAMG5_GET_IOFORM samg5_get_ioform
#define SAMG5_SET_IOGRID samg5_set_iogrid
#define SAMG5_GET_IOGRID samg5_get_iogrid
#define SAMG5_SET_IOMOVIE samg5_set_iomovie
#define SAMG5_GET_IOMOVIE samg5_get_iomovie
#define SAMG5_SET_IOSCRATCH_DEFAULT samg5_set_ioscratch_default
#define SAMG5_GET_IOSCRATCH_DEFAULT samg5_get_ioscratch_default
#define SAMG5_SET_IOUNIT_OPTA samg5_set_iounit_opta
#define SAMG5_GET_IOUNIT_OPTA samg5_get_iounit_opta
#define SAMG5_SET_IPASS_MAX_SET samg5_set_ipass_max_set
#define SAMG5_GET_IPASS_MAX_SET samg5_get_ipass_max_set
#define SAMG5_SET_IRESTRICTION_OPENMP samg5_set_irestriction_openmp
#define SAMG5_GET_IRESTRICTION_OPENMP samg5_get_irestriction_openmp
#define SAMG5_SET_IPRESSURE_UZAWA samg5_set_ipressure_uzawa
#define SAMG5_GET_IPRESSURE_UZAWA samg5_get_ipressure_uzawa
#define SAMG5_SET_IPROFILE_GEOMETRIC samg5_set_iprofile_geometric
#define SAMG5_GET_IPROFILE_GEOMETRIC samg5_get_iprofile_geometric
#define SAMG5_SET_ISAT_UZAWA samg5_set_isat_uzawa
#define SAMG5_GET_ISAT_UZAWA samg5_get_isat_uzawa
#define SAMG5_SET_ISET_VIO_DD samg5_set_iset_vio_dd
#define SAMG5_GET_ISET_VIO_DD samg5_get_iset_vio_dd
#define SAMG5_SET_ISSTEP_UZAWA samg5_set_isstep_uzawa
#define SAMG5_GET_ISSTEP_UZAWA samg5_get_isstep_uzawa
#define SAMG5_SET_ISTEP1CASE_UZAWA samg5_set_istep1case_uzawa
#define SAMG5_GET_ISTEP1CASE_UZAWA samg5_get_istep1case_uzawa
#define SAMG5_SET_ISTEERING samg5_set_isteering
#define SAMG5_GET_ISTEERING samg5_get_isteering
#define SAMG5_SET_ISWIT3_USER samg5_set_iswit3_user
#define SAMG5_GET_ISWIT3_USER samg5_get_iswit3_user
#define SAMG5_SET_ITER_CHECK samg5_set_iter_check
#define SAMG5_GET_ITER_CHECK samg5_get_iter_check
#define SAMG5_SET_ITER_MATRIX_SCALE samg5_set_iter_matrix_scale
#define SAMG5_GET_ITER_MATRIX_SCALE samg5_get_iter_matrix_scale
#define SAMG5_SET_ITER_PRE samg5_set_iter_pre
#define SAMG5_GET_ITER_PRE samg5_get_iter_pre
#define SAMG5_SET_ITMAX_CONV samg5_set_itmax_conv
#define SAMG5_GET_ITMAX_CONV samg5_get_itmax_conv
#define SAMG5_SET_ITRACE_AMGMAIN samg5_set_itrace_amgmain
#define SAMG5_GET_ITRACE_AMGMAIN samg5_get_itrace_amgmain
#define SAMG5_SET_ITRACELEVEL samg5_set_itracelevel
#define SAMG5_GET_ITRACELEVEL samg5_get_itracelevel
#define SAMG5_SET_ITRACE_CLSOL samg5_set_itrace_clsol
#define SAMG5_GET_ITRACE_CLSOL samg5_get_itrace_clsol
#define SAMG5_SET_ITRACE_CLDENSE samg5_set_itrace_cldense
#define SAMG5_GET_ITRACE_CLDENSE samg5_get_itrace_cldense
#define SAMG5_SET_ITRACE_DIVSTOP samg5_set_itrace_divstop
#define SAMG5_GET_ITRACE_DIVSTOP samg5_get_itrace_divstop
#define SAMG5_SET_ITRACE_JAC_UZAWA samg5_set_itrace_jac_uzawa
#define SAMG5_GET_ITRACE_JAC_UZAWA samg5_get_itrace_jac_uzawa
#define SAMG5_SET_ITRACE_MK_REGULAR samg5_set_itrace_mk_regular
#define SAMG5_GET_ITRACE_MK_REGULAR samg5_get_itrace_mk_regular
#define SAMG5_SET_ITRACE_MATRIX_MODE samg5_set_itrace_matrix_mode
#define SAMG5_GET_ITRACE_MATRIX_MODE samg5_get_itrace_matrix_mode
#define SAMG5_SET_ITRACE_MATRIX_STORAGE samg5_set_itrace_matrix_storage
#define SAMG5_GET_ITRACE_MATRIX_STORAGE samg5_get_itrace_matrix_storage
#define SAMG5_SET_ITRACE_SCHWARZ samg5_set_itrace_schwarz
#define SAMG5_GET_ITRACE_SCHWARZ samg5_get_itrace_schwarz
#define SAMG5_SET_ITRACE_SMO samg5_set_itrace_smo
#define SAMG5_GET_ITRACE_SMO samg5_get_itrace_smo
#define SAMG5_SET_ITRACE_SOL samg5_set_itrace_sol
#define SAMG5_GET_ITRACE_SOL samg5_get_itrace_sol
#define SAMG5_SET_ITRACE_SPLIT samg5_set_itrace_split
#define SAMG5_GET_ITRACE_SPLIT samg5_get_itrace_split
#define SAMG5_SET_ITRACE_UZAWA samg5_set_itrace_uzawa
#define SAMG5_GET_ITRACE_UZAWA samg5_get_itrace_uzawa
#define SAMG5_SET_SMOAGG_NOQR samg5_set_smoagg_noqr
#define SAMG5_GET_SMOAGG_NOQR samg5_get_smoagg_noqr
#define SAMG5_SET_STACKTRACE samg5_set_stacktrace
#define SAMG5_GET_STACKTRACE samg5_get_stacktrace
#define SAMG5_SET_STORE_PGS_FACTOR samg5_set_store_pgs_factor
#define SAMG5_GET_STORE_PGS_FACTOR samg5_get_store_pgs_factor
#define SAMG5_SET_KCYCLE_PROFILE samg5_set_kcycle_profile
#define SAMG5_GET_KCYCLE_PROFILE samg5_get_kcycle_profile
#define SAMG5_SET_KEEPMEM samg5_set_keepmem
#define SAMG5_GET_KEEPMEM samg5_get_keepmem
#define SAMG5_SET_K_DISABLE_KRYLOV1 samg5_set_k_disable_krylov1
#define SAMG5_GET_K_DISABLE_KRYLOV1 samg5_get_k_disable_krylov1
#define SAMG5_SET_K_DYNCYC samg5_set_k_dyncyc
#define SAMG5_GET_K_DYNCYC samg5_get_k_dyncyc
#define SAMG5_SET_LASTGRID samg5_set_lastgrid
#define SAMG5_GET_LASTGRID samg5_get_lastgrid
#define SAMG5_SET_LEV_COARSENING_TOO_SLOW samg5_set_lev_coarsening_too_slow
#define SAMG5_GET_LEV_COARSENING_TOO_SLOW samg5_get_lev_coarsening_too_slow
#define SAMG5_SET_LEVELS_UZAWA samg5_set_levels_uzawa
#define SAMG5_GET_LEVELS_UZAWA samg5_get_levels_uzawa
#define SAMG5_SET_LEVELX samg5_set_levelx
#define SAMG5_GET_LEVELX samg5_get_levelx
#define SAMG5_SET_LEVELX_2ND samg5_set_levelx_2nd
#define SAMG5_GET_LEVELX_2ND samg5_get_levelx_2nd
#define SAMG5_SET_LFIL_CL samg5_set_lfil_cl
#define SAMG5_GET_LFIL_CL samg5_get_lfil_cl
#define SAMG5_SET_LFIL_2ND samg5_set_lfil_2nd
#define SAMG5_GET_LFIL_2ND samg5_get_lfil_2nd
#define SAMG5_SET_LFIL_SMO samg5_set_lfil_smo
#define SAMG5_GET_LFIL_SMO samg5_get_lfil_smo
#define SAMG5_ISET_LOGFILE samg5_iset_logfile
#define SAMG5_IGET_LOGFILE samg5_iget_logfile
#define SAMG5_SET_LOGFILE samg5_set_logfile
#define SAMG5_GET_LOGFILE samg5_get_logfile
#define SAMG5_SET_LOGIO samg5_set_logio
#define SAMG5_GET_LOGIO samg5_get_logio
#define SAMG5_SET_LU_REUSE samg5_set_lu_reuse
#define SAMG5_GET_LU_REUSE samg5_get_lu_reuse
#define SAMG5_SET_MATRIX_MODE samg5_set_matrix_mode
#define SAMG5_GET_MATRIX_MODE samg5_get_matrix_mode
#define SAMG5_SET_MATRIX_FORMAT samg5_set_matrix_format
#define SAMG5_GET_MATRIX_FORMAT samg5_get_matrix_format
#define SAMG5_SET_MATRIX_SCALE_RENORM samg5_set_matrix_scale_renorm
#define SAMG5_GET_MATRIX_SCALE_RENORM samg5_get_matrix_scale_renorm
#define SAMG5_SET_MAX_CALLS samg5_set_max_calls
#define SAMG5_GET_MAX_CALLS samg5_get_max_calls
#define SAMG5_SET_MAX_CL_SIZE samg5_set_max_cl_size
#define SAMG5_GET_MAX_CL_SIZE samg5_get_max_cl_size
#define SAMG5_SET_MAXCORR_CLUSTER samg5_set_maxcorr_cluster
#define SAMG5_GET_MAXCORR_CLUSTER samg5_get_maxcorr_cluster
#define SAMG5_SET_MAX_LEVEL samg5_set_max_level
#define SAMG5_GET_MAX_LEVEL samg5_get_max_level
#define SAMG5_SET_MAX_NB_LIST_SIZE samg5_set_max_nb_list_size
#define SAMG5_GET_MAX_NB_LIST_SIZE samg5_get_max_nb_list_size
#define SAMG5_SET_MAXITER_JAC_UZAWA samg5_set_maxiter_jac_uzawa
#define SAMG5_GET_MAXITER_JAC_UZAWA samg5_get_maxiter_jac_uzawa
#define SAMG5_SET_MAXOP_RESTART samg5_set_maxop_restart
#define SAMG5_GET_MAXOP_RESTART samg5_get_maxop_restart
#define SAMG5_SET_MAXRETRY_JAC_UZAWA samg5_set_maxretry_jac_uzawa
#define SAMG5_GET_MAXRETRY_JAC_UZAWA samg5_get_maxretry_jac_uzawa
#define SAMG5_SET_MILU samg5_set_milu
#define SAMG5_GET_MILU samg5_get_milu
#define SAMG5_SET_MIN_CL_SIZE samg5_set_min_cl_size
#define SAMG5_GET_MIN_CL_SIZE samg5_get_min_cl_size
#define SAMG5_SET_MIN_MULTI_SIZE samg5_set_min_multi_size
#define SAMG5_GET_MIN_MULTI_SIZE samg5_get_min_multi_size
#define SAMG5_SET_MINITER_JAC_UZAWA samg5_set_miniter_jac_uzawa
#define SAMG5_GET_MINITER_JAC_UZAWA samg5_get_miniter_jac_uzawa
#define SAMG5_SET_MK_REGULAR samg5_set_mk_regular
#define SAMG5_GET_MK_REGULAR samg5_get_mk_regular
#define SAMG5_SET_MODE_CNTRL samg5_set_mode_cntrl
#define SAMG5_GET_MODE_CNTRL samg5_get_mode_cntrl
#define SAMG5_SET_MODE_DEBUG samg5_set_mode_debug
#define SAMG5_GET_MODE_DEBUG samg5_get_mode_debug
#define SAMG5_SET_MODE_MESS samg5_set_mode_mess
#define SAMG5_GET_MODE_MESS samg5_get_mode_mess
#define SAMG5_SET_MODIFY_MAT samg5_set_modify_mat
#define SAMG5_GET_MODIFY_MAT samg5_get_modify_mat
#define SAMG5_SET_MODIFY_RESTRICTION samg5_set_modify_restriction
#define SAMG5_GET_MODIFY_RESTRICTION samg5_get_modify_restriction
#define SAMG5_SET_MULTIPASS_ALLCOUP samg5_set_multipass_allcoup
#define SAMG5_GET_MULTIPASS_ALLCOUP samg5_get_multipass_allcoup
#define SAMG5_SET_NBLK_DEBUG samg5_set_nblk_debug
#define SAMG5_GET_NBLK_DEBUG samg5_get_nblk_debug
#define SAMG5_SET_NBLK_MAX samg5_set_nblk_max
#define SAMG5_GET_NBLK_MAX samg5_get_nblk_max
#define SAMG5_SET_NBLK_OVERLAP samg5_set_nblk_overlap
#define SAMG5_GET_NBLK_OVERLAP samg5_get_nblk_overlap
#define SAMG5_SET_NBLK_RESID samg5_set_nblk_resid
#define SAMG5_GET_NBLK_RESID samg5_get_nblk_resid
#define SAMG5_SET_NBLK_SOLVE samg5_set_nblk_solve
#define SAMG5_GET_NBLK_SOLVE samg5_get_nblk_solve
#define SAMG5_SET_NBLK_SOLVER samg5_set_nblk_solver
#define SAMG5_GET_NBLK_SOLVER samg5_get_nblk_solver
#define SAMG5_SET_NBND_OMEGA samg5_set_nbnd_omega
#define SAMG5_GET_NBND_OMEGA samg5_get_nbnd_omega
#define SAMG5_SET_NBND_OMEGA_UZAWA samg5_set_nbnd_omega_uzawa
#define SAMG5_GET_NBND_OMEGA_UZAWA samg5_get_nbnd_omega_uzawa
#define SAMG5_SET_NBND_SWEEPS samg5_set_nbnd_sweeps
#define SAMG5_GET_NBND_SWEEPS samg5_get_nbnd_sweeps
#define SAMG5_SET_NBND_SWEEPS_UZAWA samg5_set_nbnd_sweeps_uzawa
#define SAMG5_GET_NBND_SWEEPS_UZAWA samg5_get_nbnd_sweeps_uzawa
#define SAMG5_SET_NCOLOR_BLOCK_GS samg5_set_ncolor_block_gs
#define SAMG5_GET_NCOLOR_BLOCK_GS samg5_get_ncolor_block_gs
#define SAMG5_SET_NCOLOR_BLOCK_GS_MSG samg5_set_ncolor_block_gs_msg
#define SAMG5_GET_NCOLOR_BLOCK_GS_MSG samg5_get_ncolor_block_gs_msg
#define SAMG5_SET_NCOLOR_BLOCK_GS_RESCHK samg5_set_ncolor_block_gs_reschk
#define SAMG5_GET_NCOLOR_BLOCK_GS_RESCHK samg5_get_ncolor_block_gs_reschk
#define SAMG5_SET_NDEGREE_CHEBY samg5_set_ndegree_cheby
#define SAMG5_GET_NDEGREE_CHEBY samg5_get_ndegree_cheby
#define SAMG5_SET_NCFRAMES samg5_set_ncframes
#define SAMG5_GET_NCFRAMES samg5_get_ncframes
#define SAMG5_SET_NCG samg5_set_ncg
#define SAMG5_GET_NCG samg5_get_ncg
#define SAMG5_SET_NCGRAD_DEFAULT samg5_set_ncgrad_default
#define SAMG5_GET_NCGRAD_DEFAULT samg5_get_ncgrad_default
#define SAMG5_SET_NCYC_DEFAULT samg5_set_ncyc_default
#define SAMG5_GET_NCYC_DEFAULT samg5_get_ncyc_default
#define SAMG5_SET_NCYC_MIN samg5_set_ncyc_min
#define SAMG5_GET_NCYC_MIN samg5_get_ncyc_min
#define SAMG5_SET_NCYC_2ND samg5_set_ncyc_2nd
#define SAMG5_GET_NCYC_2ND samg5_get_ncyc_2nd
#define SAMG5_SET_NCYC_START samg5_set_ncyc_start
#define SAMG5_GET_NCYC_START samg5_get_ncyc_start
#define SAMG5_SET_NDYN_SMO samg5_set_ndyn_smo
#define SAMG5_GET_NDYN_SMO samg5_get_ndyn_smo
#define SAMG5_SET_NEG_DIAG samg5_set_neg_diag
#define SAMG5_GET_NEG_DIAG samg5_get_neg_diag
#define SAMG5_SET_NEG_DIAG_BRUTE samg5_set_neg_diag_brute
#define SAMG5_GET_NEG_DIAG_BRUTE samg5_get_neg_diag_brute
#define SAMG5_SET_NEW_ENTRIES samg5_set_new_entries
#define SAMG5_GET_NEW_ENTRIES samg5_get_new_entries
#define SAMG5_SET_NEW_TOPOLOGY samg5_set_new_topology
#define SAMG5_GET_NEW_TOPOLOGY samg5_get_new_topology
#define SAMG5_SET_NILU_REORDER samg5_set_nilu_reorder
#define SAMG5_GET_NILU_REORDER samg5_get_nilu_reorder
#define SAMG5_SET_NINCR_RES_ACCEPTED_MG samg5_set_nincr_res_accepted_mg
#define SAMG5_GET_NINCR_RES_ACCEPTED_MG samg5_get_nincr_res_accepted_mg
#define SAMG5_SET_NINCR_RES_ACCEPTED_1G samg5_set_nincr_res_accepted_1g
#define SAMG5_GET_NINCR_RES_ACCEPTED_1G samg5_get_nincr_res_accepted_1g
#define SAMG5_SET_NINT_ROWSUM1 samg5_set_nint_rowsum1
#define SAMG5_GET_NINT_ROWSUM1 samg5_get_nint_rowsum1
#define SAMG5_SET_NINTER_OMP samg5_set_ninter_omp
#define SAMG5_GET_NINTER_OMP samg5_get_ninter_omp
#define SAMG5_SET_NITER_SKIP samg5_set_niter_skip
#define SAMG5_GET_NITER_SKIP samg5_get_niter_skip
#define SAMG5_SET_NKCYCLE samg5_set_nkcycle
#define SAMG5_GET_NKCYCLE samg5_get_nkcycle
#define SAMG5_SET_NKDIM_DEFAULT samg5_set_nkdim_default
#define SAMG5_GET_NKDIM_DEFAULT samg5_get_nkdim_default
#define SAMG5_SET_NSMOOTH_COO_POLY samg5_set_nsmooth_coo_poly
#define SAMG5_GET_NSMOOTH_COO_POLY samg5_get_nsmooth_coo_poly
#define SAMG5_SET_NSMOAGG samg5_set_nsmoagg
#define SAMG5_GET_NSMOAGG samg5_get_nsmoagg
#define SAMG5_SET_NSMOAGG1LEV samg5_set_nsmoagg1lev
#define SAMG5_GET_NSMOAGG1LEV samg5_get_nsmoagg1lev
#define SAMG5_SET_NSMOAGGLEV samg5_set_nsmoagglev
#define SAMG5_GET_NSMOAGGLEV samg5_get_nsmoagglev
#define SAMG5_SET_NMIN_MATRIX samg5_set_nmin_matrix
#define SAMG5_GET_NMIN_MATRIX samg5_get_nmin_matrix
#define SAMG5_SET_NMIN_MATRIX_RESC samg5_set_nmin_matrix_resc
#define SAMG5_GET_NMIN_MATRIX_RESC samg5_get_nmin_matrix_resc
#define SAMG5_SET_NMIN_VECTOR samg5_set_nmin_vector
#define SAMG5_GET_NMIN_VECTOR samg5_get_nmin_vector
#define SAMG5_SET_NOTALLUNS_CHEAP samg5_set_notalluns_cheap
#define SAMG5_GET_NOTALLUNS_CHEAP samg5_get_notalluns_cheap
#define SAMG5_SET_NP_MOD1 samg5_set_np_mod1
#define SAMG5_GET_NP_MOD1 samg5_get_np_mod1
#define SAMG5_SET_NP_MOD2 samg5_set_np_mod2
#define SAMG5_GET_NP_MOD2 samg5_get_np_mod2
#define SAMG5_SET_NP_OPT samg5_set_np_opt
#define SAMG5_GET_NP_OPT samg5_get_np_opt
#define SAMG5_SET_NPRIM_AT_ALLPNTS samg5_set_nprim_at_allpnts
#define SAMG5_GET_NPRIM_AT_ALLPNTS samg5_get_nprim_at_allpnts
#define SAMG5_SET_NPTMAX samg5_set_nptmax
#define SAMG5_GET_NPTMAX samg5_get_nptmax
#define SAMG5_SET_NPTMN samg5_set_nptmn
#define SAMG5_GET_NPTMN samg5_get_nptmn
#define SAMG5_SET_NRC samg5_set_nrc
#define SAMG5_GET_NRC samg5_get_nrc
#define SAMG5_SET_NRC_EMERGENCY samg5_set_nrc_emergency
#define SAMG5_GET_NRC_EMERGENCY samg5_get_nrc_emergency
#define SAMG5_SET_NRD samg5_set_nrd
#define SAMG5_GET_NRD samg5_get_nrd
#define SAMG5_SET_NRD_2ND samg5_set_nrd_2nd
#define SAMG5_GET_NRD_2ND samg5_get_nrd_2nd
#define SAMG5_SET_NRU samg5_set_nru
#define SAMG5_GET_NRU samg5_get_nru
#define SAMG5_SET_NRU_2ND samg5_set_nru_2nd
#define SAMG5_GET_NRU_2ND samg5_get_nru_2nd
#define SAMG5_SET_NSIMPLE_EMERGENCY samg5_set_nsimple_emergency
#define SAMG5_GET_NSIMPLE_EMERGENCY samg5_get_nsimple_emergency
#define SAMG5_SET_NSOLVE_DEFAULT samg5_set_nsolve_default
#define SAMG5_GET_NSOLVE_DEFAULT samg5_get_nsolve_default
#define SAMG5_SET_NSOLVE_2ND samg5_set_nsolve_2nd
#define SAMG5_GET_NSOLVE_2ND samg5_get_nsolve_2nd
#define SAMG5_SET_NSOLVE_UZAWA samg5_set_nsolve_uzawa
#define SAMG5_GET_NSOLVE_UZAWA samg5_get_nsolve_uzawa
#define SAMG5_SET_NSTAR_TYP samg5_set_nstar_typ
#define SAMG5_GET_NSTAR_TYP samg5_get_nstar_typ
#define SAMG5_SET_NSW_OMEGA_UZAWA samg5_set_nsw_omega_uzawa
#define SAMG5_GET_NSW_OMEGA_UZAWA samg5_get_nsw_omega_uzawa
#define SAMG5_SET_NSW_UZAWA samg5_set_nsw_uzawa
#define SAMG5_GET_NSW_UZAWA samg5_get_nsw_uzawa
#define SAMG5_SET_NTAKE_RES_IN samg5_set_ntake_res_in
#define SAMG5_GET_NTAKE_RES_IN samg5_get_ntake_res_in
#define SAMG5_SET_NTH_RES_SCRATCH samg5_set_nth_res_scratch
#define SAMG5_GET_NTH_RES_SCRATCH samg5_get_nth_res_scratch
#define SAMG5_SET_NTR samg5_set_ntr
#define SAMG5_GET_NTR samg5_get_ntr
#define SAMG5_SET_NTR_PRIM samg5_set_ntr_prim
#define SAMG5_GET_NTR_PRIM samg5_get_ntr_prim
#define SAMG5_SET_NTYP_ACCEL samg5_set_ntyp_accel
#define SAMG5_GET_NTYP_ACCEL samg5_get_ntyp_accel
#define SAMG5_SET_NTYP_GALERKIN samg5_set_ntyp_galerkin
#define SAMG5_GET_NTYP_GALERKIN samg5_get_ntyp_galerkin
#define SAMG5_SET_NUMTRY_MAX_SET samg5_set_numtry_max_set
#define SAMG5_GET_NUMTRY_MAX_SET samg5_get_numtry_max_set
#define SAMG5_SET_NVERSION samg5_set_nversion
#define SAMG5_GET_NVERSION samg5_get_nversion
#define SAMG5_SET_NWT samg5_set_nwt
#define SAMG5_GET_NWT samg5_get_nwt
#define SAMG5_SET_NXTYP_COARSE samg5_set_nxtyp_coarse
#define SAMG5_GET_NXTYP_COARSE samg5_get_nxtyp_coarse
#define SAMG5_SET_OIL_ACCEL samg5_set_oil_accel
#define SAMG5_GET_OIL_ACCEL samg5_get_oil_accel
#define SAMG5_SET_OIL_GPRS samg5_set_oil_gprs
#define SAMG5_GET_OIL_GPRS samg5_get_oil_gprs
#define SAMG5_SET_OIL_NOPRIM samg5_set_oil_noprim
#define SAMG5_GET_OIL_NOPRIM samg5_get_oil_noprim
#define SAMG5_SET_OMEGA_JAC_ES_UZAWA samg5_set_omega_jac_es_uzawa
#define SAMG5_GET_OMEGA_JAC_ES_UZAWA samg5_get_omega_jac_es_uzawa
#define SAMG5_SET_OMEGA_JAC_P_UZAWA samg5_set_omega_jac_p_uzawa
#define SAMG5_GET_OMEGA_JAC_P_UZAWA samg5_get_omega_jac_p_uzawa
#define SAMG5_SET_OMEGA_JACOBI samg5_set_omega_jacobi
#define SAMG5_GET_OMEGA_JACOBI samg5_get_omega_jacobi
#define SAMG5_SET_OMEGA_SOR_DO samg5_set_omega_sor_do
#define SAMG5_GET_OMEGA_SOR_DO samg5_get_omega_sor_do
#define SAMG5_SET_OMEGA_SOR_UP samg5_set_omega_sor_up
#define SAMG5_GET_OMEGA_SOR_UP samg5_get_omega_sor_up
#define SAMG5_SET_OMEGA_SMO samg5_set_omega_smo
#define SAMG5_GET_OMEGA_SMO samg5_get_omega_smo
#define SAMG5_SET_OMEGA_SMO_MIN samg5_set_omega_smo_min
#define SAMG5_GET_OMEGA_SMO_MIN samg5_get_omega_smo_min
#define SAMG5_SET_OMEGA_UZAWA samg5_set_omega_uzawa
#define SAMG5_GET_OMEGA_UZAWA samg5_get_omega_uzawa
#define SAMG5_SET_OMP_ILU samg5_set_omp_ilu
#define SAMG5_GET_OMP_ILU samg5_get_omp_ilu
#define SAMG5_ISET_OMP_PARTITION_FILE samg5_iset_omp_partition_file
#define SAMG5_IGET_OMP_PARTITION_FILE samg5_iget_omp_partition_file
#define SAMG5_SET_OMP_PARTITION_FILE samg5_set_omp_partition_file
#define SAMG5_GET_OMP_PARTITION_FILE samg5_get_omp_partition_file
#define SAMG5_SET_OMP_NUM_THREADS_EXTERNAL samg5_set_omp_num_threads_external
#define SAMG5_GET_OMP_NUM_THREADS_EXTERNAL samg5_get_omp_num_threads_external
#define SAMG5_SET_OMP_NTHREADS_ONLY4SPLIT samg5_set_omp_nthreads_only4split
#define SAMG5_GET_OMP_NTHREADS_ONLY4SPLIT samg5_get_omp_nthreads_only4split
#define SAMG5_SET_OMP_UZAWA samg5_set_omp_uzawa
#define SAMG5_GET_OMP_UZAWA samg5_get_omp_uzawa
#define SAMG5_SET_OPT_MATRIX_OPS samg5_set_opt_matrix_ops
#define SAMG5_GET_OPT_MATRIX_OPS samg5_get_opt_matrix_ops
#define SAMG5_SET_P_CMPLX_AGG_DEFAULT samg5_set_p_cmplx_agg_default
#define SAMG5_GET_P_CMPLX_AGG_DEFAULT samg5_get_p_cmplx_agg_default
#define SAMG5_SET_P_CMPLX_DEFAULT samg5_set_p_cmplx_default
#define SAMG5_GET_P_CMPLX_DEFAULT samg5_get_p_cmplx_default
#define SAMG5_SET_PARTIAL_FRAC samg5_set_partial_frac
#define SAMG5_GET_PARTIAL_FRAC samg5_get_partial_frac
#define SAMG5_ISET_PARTITION_FILE samg5_iset_partition_file
#define SAMG5_IGET_PARTITION_FILE samg5_iget_partition_file
#define SAMG5_SET_PARTITION_FILE samg5_set_partition_file
#define SAMG5_GET_PARTITION_FILE samg5_get_partition_file
#define SAMG5_SET_AMG_RENUMBER samg5_set_amg_renumber
#define SAMG5_GET_AMG_RENUMBER samg5_get_amg_renumber
#define SAMG5_ISET_AMG_RENUMBER_FILE samg5_iset_amg_renumber_file
#define SAMG5_IGET_AMG_RENUMBER_FILE samg5_iget_amg_renumber_file
#define SAMG5_SET_AMG_RENUMBER_FILE samg5_set_amg_renumber_file
#define SAMG5_GET_AMG_RENUMBER_FILE samg5_get_amg_renumber_file
#define SAMG5_ISET_DUMPFILE_RENUMBER samg5_iset_dumpfile_renumber
#define SAMG5_IGET_DUMPFILE_RENUMBER samg5_iget_dumpfile_renumber
#define SAMG5_SET_DUMPFILE_RENUMBER samg5_set_dumpfile_renumber
#define SAMG5_GET_DUMPFILE_RENUMBER samg5_get_dumpfile_renumber
#define SAMG5_SET_PERF_METER_ENABLED samg5_set_perf_meter_enabled
#define SAMG5_GET_PERF_METER_ENABLED samg5_get_perf_meter_enabled
#define SAMG5_SET_PRIM_NORM samg5_set_prim_norm
#define SAMG5_GET_PRIM_NORM samg5_get_prim_norm
#define SAMG5_SET_PRIM_PRINT samg5_set_prim_print
#define SAMG5_GET_PRIM_PRINT samg5_get_prim_print
#define SAMG5_SET_PRINT_NXTYP_COARSE_MSG samg5_set_print_nxtyp_coarse_msg
#define SAMG5_GET_PRINT_NXTYP_COARSE_MSG samg5_get_print_nxtyp_coarse_msg
#define SAMG5_SET_PRINT_SETUP_ILU_OR_DIRECT samg5_set_print_setup_ilu_or_direct
#define SAMG5_GET_PRINT_SETUP_ILU_OR_DIRECT samg5_get_print_setup_ilu_or_direct
#define SAMG5_SET_PRNT_STAT_SCHWARZ samg5_set_prnt_stat_schwarz
#define SAMG5_GET_PRNT_STAT_SCHWARZ samg5_get_prnt_stat_schwarz
#define SAMG5_SET_QUASI_ONLY samg5_set_quasi_only
#define SAMG5_GET_QUASI_ONLY samg5_get_quasi_only
#define SAMG5_SET_REDUCT_KCYCLE samg5_set_reduct_kcycle
#define SAMG5_GET_REDUCT_KCYCLE samg5_get_reduct_kcycle
#define SAMG5_SET_RBM_INTERN_INFO samg5_set_rbm_intern_info
#define SAMG5_GET_RBM_INTERN_INFO samg5_get_rbm_intern_info
#define SAMG5_SET_RCONDX samg5_set_rcondx
#define SAMG5_GET_RCONDX samg5_get_rcondx
#define SAMG5_SET_READ_UZAWA_PARMS samg5_set_read_uzawa_parms
#define SAMG5_GET_READ_UZAWA_PARMS samg5_get_read_uzawa_parms
#define SAMG5_SET_READ_MARIAN_COARSENING samg5_set_read_marian_coarsening
#define SAMG5_GET_READ_MARIAN_COARSENING samg5_get_read_marian_coarsening
#define SAMG5_SET_REFRESH_CALLED samg5_set_refresh_called
#define SAMG5_GET_REFRESH_CALLED samg5_get_refresh_called
#define SAMG5_SET_REL_APP_VAR samg5_set_rel_app_var
#define SAMG5_GET_REL_APP_VAR samg5_get_rel_app_var
#define SAMG5_SET_RHO_MIN samg5_set_rho_min
#define SAMG5_GET_RHO_MIN samg5_get_rho_min
#define SAMG5_SET_RHO_OK samg5_set_rho_ok
#define SAMG5_GET_RHO_OK samg5_get_rho_ok
#define SAMG5_SET_SHOW_UN_RES samg5_set_show_un_res
#define SAMG5_GET_SHOW_UN_RES samg5_get_show_un_res
#define SAMG5_ISET_SCRATCHFILE samg5_iset_scratchfile
#define SAMG5_IGET_SCRATCHFILE samg5_iget_scratchfile
#define SAMG5_SET_SCRATCHFILE samg5_set_scratchfile
#define SAMG5_GET_SCRATCHFILE samg5_get_scratchfile
#define SAMG5_SET_SLOW_COARSENING samg5_set_slow_coarsening
#define SAMG5_GET_SLOW_COARSENING samg5_get_slow_coarsening
#define SAMG5_SET_STABILITY samg5_set_stability
#define SAMG5_GET_STABILITY samg5_get_stability
#define SAMG5_SET_STRUCT_IDENT samg5_set_struct_ident
#define SAMG5_GET_STRUCT_IDENT samg5_get_struct_ident
#define SAMG5_SET_STRUCT_SYMM samg5_set_struct_symm
#define SAMG5_GET_STRUCT_SYMM samg5_get_struct_symm
#define SAMG5_SET_TAU_UZAWA samg5_set_tau_uzawa
#define SAMG5_GET_TAU_UZAWA samg5_get_tau_uzawa
#define SAMG5_SET_TERM_COARSENING samg5_set_term_coarsening
#define SAMG5_GET_TERM_COARSENING samg5_get_term_coarsening
#define SAMG5_SET_TRACE_L2_QUASI_RES samg5_set_trace_l2_quasi_res
#define SAMG5_GET_TRACE_L2_QUASI_RES samg5_get_trace_l2_quasi_res
#define SAMG5_SET_TRACKMEM samg5_set_trackmem
#define SAMG5_GET_TRACKMEM samg5_get_trackmem
#define SAMG5_SET_TRACKRESID samg5_set_trackresid
#define SAMG5_GET_TRACKRESID samg5_get_trackresid
#define SAMG5_SET_TRACK_AP_P samg5_set_track_ap_p
#define SAMG5_GET_TRACK_AP_P samg5_get_track_ap_p
#define SAMG5_SET_USE_IC samg5_set_use_ic
#define SAMG5_GET_USE_IC samg5_get_use_ic
#define SAMG5_SET_VIO_DD samg5_set_vio_dd
#define SAMG5_GET_VIO_DD samg5_get_vio_dd
#define SAMG5_SET_W_AVRGE_AGG_DEFAULT samg5_set_w_avrge_agg_default
#define SAMG5_GET_W_AVRGE_AGG_DEFAULT samg5_get_w_avrge_agg_default
#define SAMG5_SET_W_AVRGE_DEFAULT samg5_set_w_avrge_default
#define SAMG5_GET_W_AVRGE_DEFAULT samg5_get_w_avrge_default
#define SAMG5_SET_WCOUPLED samg5_set_wcoupled
#define SAMG5_GET_WCOUPLED samg5_get_wcoupled
#define SAMG5_SET_WFT samg5_set_wft
#define SAMG5_GET_WFT samg5_get_wft
#define SAMG5_SET_WLEN_SWITCHES_GALERKIN samg5_set_wlen_switches_galerkin
#define SAMG5_GET_WLEN_SWITCHES_GALERKIN samg5_get_wlen_switches_galerkin
#define SAMG5_SET_WRITE_CLUSTER_ID samg5_set_write_cluster_id
#define SAMG5_GET_WRITE_CLUSTER_ID samg5_get_write_cluster_id
#define SAMG5_SET_WTSL samg5_set_wtsl
#define SAMG5_GET_WTSL samg5_get_wtsl
#define SAMG5_RELEASE_INFO samg5_release_info
#define SAMG5_VERSION_INFO samg5_version_info
#define SAMG5_DETAILS_INFO samg5_details_info
#endif

