openCSMP/openCSMP/lib/samg/samg5.h
#ifdef SAMG_LCASE_USCORE
#define SAMG5 samg5_
#define SAMG5_CTIME samg5_ctime_
#define SAMG5_CPUTIME samg5_cputime_
#define SAMG5_ELAPSED_TIME samg5_elapsed_time_
#define SAMG5_ALL_ERRORINFO samg5_all_errorinfo_
#define SAMG5_SIMPLE samg5_simple_
#define SAMG5_MAIN samg5_main_
#define SAMG5_LEAVE samg5_leave_
#define SAMG5_REFRESH samg5_refresh_
#define SAMG5_CLEANUP samg5_cleanup_
#define SAMG5_RESET_HIDDEN samg5_reset_hidden_
#define SAMG5_GET_COMPLEXITIES samg5_get_complexities_
#define SAMG5_GET_NFLAG samg5_get_nflag_
#define SAMG5_SET_NFLAG samg5_set_nflag_
#define SAMG5_GET_NFLAGO samg5_get_nflago_
#define SAMG5_SET_NFLAGO samg5_set_nflago_
#define SAMG5_GET_NFLAGP samg5_get_nflagp_
#define SAMG5_SET_NFLAGP samg5_set_nflagp_
#define SAMG5_GET_NFLAGS samg5_get_nflags_
#define SAMG5_SET_NFLAGS samg5_set_nflags_
#define SAMG5_GET_LEVELS_CREATED samg5_get_levels_created_
#define SAMG5_GET_LEVELS_USED samg5_get_levels_used_
#define SAMG5_GET_LEV_SIZES samg5_get_lev_sizes_
#define SAMG5_GET_MEM_ACTIVE samg5_get_mem_active_
#define SAMG5_GET_TIME_AND_MEM samg5_get_time_and_mem_
#define SAMG5_EXTRAPRINT samg5_extraprint_
#define SAMG5_FLUSH samg5_flush_
#define SAMG5_CVEC_ALLOC samg5_cvec_alloc_
#define SAMG5_CVEC_DEALLOC samg5_cvec_dealloc_
#define SAMG5_CVEC_SET samg5_cvec_set_
#define SAMG5_CVEC_GET samg5_cvec_get_
#define SAMG5_PROPOSE_NSYS_ISCALE_IU samg5_propose_nsys_iscale_iu_
#define SAMG5_USED_OMP_THREADS samg5_used_omp_threads_
#define SAMG5_GET_INNERMAX samg5_get_innermax_
#define SAMG5_SET_INNERMAX samg5_set_innermax_
#define SAMG5_DRV_SET_INNERMAX samg5_drv5_set_innermax_
#define SAMG5_GET_NUM_SMOOTH_VECTORS samg5_get_num_smooth_vectors_
#define SAMG5_SMOOTH_VECTOR_INIT samg5_smooth_vector_init_
#define SAMG5_SMOOTH_VECTOR_SET samg5_smooth_vector_set_
#define SAMG5_SMOOTH_VECTOR_GET samg5_smooth_vector_get_
#define SAMG5_GET_NUM_DEFLATION_VECTORS samg5_get_num_deflation_vectors_
#define SAMG5_DEFLATION_VECTOR_INIT samg5_deflation_vector_init_
#define SAMG5_DEFLATION_VECTOR_SET samg5_deflation_vector_set_
#define SAMG5_DEFLATION_VECTOR_GET samg5_deflation_vector_get_
#define SAMG5_USER_CHECK samg5_user_check_
#define SAMG5_USER_SOLVE samg5_user_solve_
#define SAMG5_USER_CLEANUP samg5_user_cleanup_
#define SAMG5_ARRAY_OFFSET samg5_array_offset_
#define SAMG5_PERFINIT samg5_perfinit_
#define SAMG5_PERFOUT samg5_perfout_
#define SAMG5_PARALLEL_LIB samg5_parallel_lib_
#define SAMG5_MEM_INFO samg5_mem_info_
#define SAMG5_LRATIO samg5_lratio_
#define SAMG5_ADDTIME samg5_addtime_
#define SAMG5_COMPTIME samg5_comptime_
#define SAMG5_COPY_GALERKIN samg5_copy_galerkin_
#define SAMG5_OMEGA_JACOBI_ALLOC samg5_omega_jacobi_alloc_
#define SAMG5_OMEGA_JACOBI_DEALLOC samg5_omega_jacobi_dealloc_
#define SAMG5_OMEGA_JACOBI_SET samg5_omega_jacobi_set_
#define SAMG5_CURRENT_RESIDUAL samg5_current_residual_
#define SAMG5_OPEN_LOGFILE samg5_open_logfile_
#define SAMG5_CLOSE_LOGFILE samg5_close_logfile_
#define SAMG5_COO_VEC_SET samg5_coo_vec_set_
#define SAMG5_COO_VEC_ALLOC samg5_coo_vec_alloc_
#define SAMG5_COO_VEC_DEALLOC samg5_coo_vec_dealloc_
#define SAMG5_IDEC samg5_idec_
#define SAMG5_DC samg5_dc_
#define XSAMG5 xsamg5_
#define XSAMG5_DC xsamg5_dc_
#define XSAMG5_START xsamg5_start_
#define XSAMG5_START_LINUX xsamg5_start_linux_
#define XSAMG5_USER_CTRL xsamg5_user_ctrl_
#define XSAMG5_START_IUM xsamg5_start_ium_
#define XSAMG5_START_SOLVER xsamg5_start_solver_
#define XSAMG5_END_SOLVER xsamg5_end_solver_
#define XSAMG5_FINALIZE xsamg5_finalize_
#define XSAMG5_END xsamg5_end_
#define XSAMG5_GET_LOGIO xsamg5_get_logio_
#define XSAMG5_GET_SLAVE_RETURNCODE xsamg5_get_slave_returncode_
#define XSAMG5_PROCESS_INFO xsamg5_process_info_
#define XSAMG5_GET_INTERNAL_TIMER xsamg5_get_internal_timer_
#define XSAMG5_MPI_INIT xsamg5_mpi_init_
#define XSAMG5_MPI_FINALIZE xsamg5_mpi_finalize_
#define XSAMG5_MPI_COMM_RANK xsamg5_mpi_comm_rank_
#define XSAMG5_GET_MPI_COMM_WORLD xsamg5_get_mpi_comm_world_
#define XSAMG5_GET_PARALLEL_RUN xsamg5_get_parallel_run_
#define XSAMG5_IO_SETTINGS xsamg5_io_settings_
#define XSAMG5_IO_SETTINGS2 xsamg5_io_settings2_
#define XSAMG5_LAST_MSG xsamg5_last_msg_
#define XSAMG5_READ_CONFIG xsamg5_read_config_
#define XSAMG5_PRINT_INTERNAL_TIMER xsamg5_print_internal_timer_
#define XSAMG5_ERROR_INFO xsamg5_error_info_
#define XSAMG5_GET_IERR_ON_TAG_STOP xsamg5_get_ierr_on_tag_stop_
#define XSAMG5_CONFIGFILE_MISSING xsamg5_configfile_missing_
#define XSAMG5_LEAVE xsamg5_leave_
#define XSAMG5_CLEANUP xsamg5_cleanup_
#define SAMG5_DUMP_SEQUENCE_RESET samg5_dump_sequence_reset_
#define SAMG5_GET_RESIDUAL_VECTOR_E samg5_get_residual_vector_e_
#define SAMG5_GET_RESIDUAL_VECTOR_V samg5_get_residual_vector_v_
#define SAMG5_RESIDUAL_VECTOR_LEAVE samg5_residual_vector_leave_
#define SAMG5_SET_RESIDUAL_VECTOR_E samg5_set_residual_vector_e_
#define SAMG5_SET_RESIDUAL_VECTOR_V samg5_set_residual_vector_v_
#define SAMG5_SET_RESIDUAL_VECTOR_INIT samg5_set_residual_vector_init_
#define XSAMG5_OIL xsamg5_oil_
#define SAMG5_OIL samg5_oil_
#define SAMG5_SET_RENUMBER_VEC samg5_set_renumber_vec_
#define SAMG5_GET_RENUMBER_VEC samg5_get_renumber_vec_
#define SAMG5_GETRE_NU samg5_getre_nu_
#define SAMG5_GETDBLE_NU samg5_getdble_nu_
#define SAMG5_GETINT_NU samg5_getint_nu_
#define SAMG5_GETTE_NU samg5_gette_nu_
#define SAMG5_GETLO_NU samg5_getlo_nu_
#define SAMG5_GETSPEC_NU samg5_getspec_nu_
#define SAMG5_SET_A_CMPLX_AGG_DEFAULT samg5_set_a_cmplx_agg_default_
#define SAMG5_GET_A_CMPLX_AGG_DEFAULT samg5_get_a_cmplx_agg_default_
#define SAMG5_SET_A_CMPLX_DEFAULT samg5_set_a_cmplx_default_
#define SAMG5_GET_A_CMPLX_DEFAULT samg5_get_a_cmplx_default_
#define SAMG5_SET_ALLOW_FILNAM_IN samg5_set_allow_filnam_in_
#define SAMG5_GET_ALLOW_FILNAM_IN samg5_get_allow_filnam_in_
#define SAMG5_SET_ALLOW_PRIVATE_IN samg5_set_allow_private_in_
#define SAMG5_GET_ALLOW_PRIVATE_IN samg5_get_allow_private_in_
#define SAMG5_SET_ALLOW_ELIM samg5_set_allow_elim_
#define SAMG5_GET_ALLOW_ELIM samg5_get_allow_elim_
#define SAMG5_SET_ALLUNS_AT_ALLPNTS samg5_set_alluns_at_allpnts_
#define SAMG5_GET_ALLUNS_AT_ALLPNTS samg5_get_alluns_at_allpnts_
#define SAMG5_SET_ART_TIME samg5_set_art_time_
#define SAMG5_GET_ART_TIME samg5_get_art_time_
#define SAMG5_SET_ART_TIME_CYC samg5_set_art_time_cyc_
#define SAMG5_GET_ART_TIME_CYC samg5_get_art_time_cyc_
#define SAMG5_SET_ART_TIME_CYC_2ND samg5_set_art_time_cyc_2nd_
#define SAMG5_GET_ART_TIME_CYC_2ND samg5_get_art_time_cyc_2nd_
#define SAMG5_SET_ART_TIME_SETUP samg5_set_art_time_setup_
#define SAMG5_GET_ART_TIME_SETUP samg5_get_art_time_setup_
#define SAMG5_SET_ART_TIME_SETUP_2ND samg5_set_art_time_setup_2nd_
#define SAMG5_GET_ART_TIME_SETUP_2ND samg5_get_art_time_setup_2nd_
#define SAMG5_SET_B_CMPLX samg5_set_b_cmplx_
#define SAMG5_GET_B_CMPLX samg5_get_b_cmplx_
#define SAMG5_SET_B_CMPLX_AGG_DEFAULT samg5_set_b_cmplx_agg_default_
#define SAMG5_GET_B_CMPLX_AGG_DEFAULT samg5_get_b_cmplx_agg_default_
#define SAMG5_SET_B_CMPLX_DEFAULT samg5_set_b_cmplx_default_
#define SAMG5_GET_B_CMPLX_DEFAULT samg5_get_b_cmplx_default_
#define SAMG5_SET_BACKUP samg5_set_backup_
#define SAMG5_GET_BACKUP samg5_get_backup_
#define SAMG5_SET_BLK_FILLEXP samg5_set_blk_fillexp_
#define SAMG5_GET_BLK_FILLEXP samg5_get_blk_fillexp_
#define SAMG5_SET_BLK_STAB samg5_set_blk_stab_
#define SAMG5_GET_BLK_STAB samg5_get_blk_stab_
#define SAMG5_SET_BLOCK_SCALE samg5_set_block_scale_
#define SAMG5_GET_BLOCK_SCALE samg5_get_block_scale_
#define SAMG5_SET_BLOCK_SCALE2 samg5_set_block_scale2_
#define SAMG5_GET_BLOCK_SCALE2 samg5_get_block_scale2_
#define SAMG5_SET_BLOCK_SCALE3 samg5_set_block_scale3_
#define SAMG5_GET_BLOCK_SCALE3 samg5_get_block_scale3_
#define SAMG5_SET_BS_AUTO_SIGN samg5_set_bs_auto_sign_
#define SAMG5_GET_BS_AUTO_SIGN samg5_get_bs_auto_sign_
#define SAMG5_SET_BS_MIN_BLOCK_SIZE samg5_set_bs_min_block_size_
#define SAMG5_GET_BS_MIN_BLOCK_SIZE samg5_get_bs_min_block_size_
#define SAMG5_SET_BS_OMP samg5_set_bs_omp_
#define SAMG5_GET_BS_OMP samg5_get_bs_omp_
#define SAMG5_ISET_BND_PARTITION_FILE samg5_iset_bnd_partition_file_
#define SAMG5_IGET_BND_PARTITION_FILE samg5_iget_bnd_partition_file_
#define SAMG5_SET_BND_PARTITION_FILE samg5_set_bnd_partition_file_
#define SAMG5_GET_BND_PARTITION_FILE samg5_get_bnd_partition_file_
#define SAMG5_SET_CHECK_ALLPNTS samg5_set_check_allpnts_
#define SAMG5_GET_CHECK_ALLPNTS samg5_get_check_allpnts_
#define SAMG5_SET_CHECK_ORDER samg5_set_check_order_
#define SAMG5_GET_CHECK_ORDER samg5_get_check_order_
#define SAMG5_SET_CHECK_BCSR_DUMP samg5_set_check_bcsr_dump_
#define SAMG5_GET_CHECK_BCSR_DUMP samg5_get_check_bcsr_dump_
#define SAMG5_SET_CL_CPL samg5_set_cl_cpl_
#define SAMG5_GET_CL_CPL samg5_get_cl_cpl_
#define SAMG5_SET_CL_ORDER samg5_set_cl_order_
#define SAMG5_GET_CL_ORDER samg5_get_cl_order_
#define SAMG5_SET_CL_OUTRES samg5_set_cl_outres_
#define SAMG5_GET_CL_OUTRES samg5_get_cl_outres_
#define SAMG5_SET_CL_LEVEL_DEP samg5_set_cl_level_dep_
#define SAMG5_GET_CL_LEVEL_DEP samg5_get_cl_level_dep_
#define SAMG5_SET_CL_AUTO_SIZE samg5_set_cl_auto_size_
#define SAMG5_GET_CL_AUTO_SIZE samg5_get_cl_auto_size_
#define SAMG5_SET_CL_PROC_BORDER samg5_set_cl_proc_border_
#define SAMG5_GET_CL_PROC_BORDER samg5_get_cl_proc_border_
#define SAMG5_SET_CL_QUALITY_MEASURE samg5_set_cl_quality_measure_
#define SAMG5_GET_CL_QUALITY_MEASURE samg5_get_cl_quality_measure_
#define SAMG5_SET_CL_GLOBAL_QUALITY samg5_set_cl_global_quality_
#define SAMG5_GET_CL_GLOBAL_QUALITY samg5_get_cl_global_quality_
#define SAMG5_SET_CL_OMP samg5_set_cl_omp_
#define SAMG5_GET_CL_OMP samg5_get_cl_omp_
#define SAMG5_SET_CL_CMK_REORDER samg5_set_cl_cmk_reorder_
#define SAMG5_GET_CL_CMK_REORDER samg5_get_cl_cmk_reorder_
#define SAMG5_SET_CLSOLVER_FINEST samg5_set_clsolver_finest_
#define SAMG5_GET_CLSOLVER_FINEST samg5_get_clsolver_finest_
#define SAMG5_SET_CLDENSE_CTRL samg5_set_cldense_ctrl_
#define SAMG5_GET_CLDENSE_CTRL samg5_get_cldense_ctrl_
#define SAMG5_SET_CONST_INT_GLK samg5_set_const_int_glk_
#define SAMG5_GET_CONST_INT_GLK samg5_get_const_int_glk_
#define SAMG5_SET_CONST_INT_SOL samg5_set_const_int_sol_
#define SAMG5_GET_CONST_INT_SOL samg5_get_const_int_sol_
#define SAMG5_SET_CNTRL_ENFORCE samg5_set_cntrl_enforce_
#define SAMG5_GET_CNTRL_ENFORCE samg5_get_cntrl_enforce_
#define SAMG5_SET_CNTRL_LOGFILE samg5_set_cntrl_logfile_
#define SAMG5_GET_CNTRL_LOGFILE samg5_get_cntrl_logfile_
#define SAMG5_SET_CNTRL_METHOD samg5_set_cntrl_method_
#define SAMG5_GET_CNTRL_METHOD samg5_get_cntrl_method_
#define SAMG5_SET_CNTRL_RELEASE samg5_set_cntrl_release_
#define SAMG5_GET_CNTRL_RELEASE samg5_get_cntrl_release_
#define SAMG5_SET_CNTRL_RES_DIFF samg5_set_cntrl_res_diff_
#define SAMG5_GET_CNTRL_RES_DIFF samg5_get_cntrl_res_diff_
#define SAMG5_SET_CNTRL_RETRY_ITER samg5_set_cntrl_retry_iter_
#define SAMG5_GET_CNTRL_RETRY_ITER samg5_get_cntrl_retry_iter_
#define SAMG5_SET_CNTRL_STEADY samg5_set_cntrl_steady_
#define SAMG5_GET_CNTRL_STEADY samg5_get_cntrl_steady_
#define SAMG5_SET_CONV_STOP samg5_set_conv_stop_
#define SAMG5_GET_CONV_STOP samg5_get_conv_stop_
#define SAMG5_SET_CORRECT_CLUSTER_INFO samg5_set_correct_cluster_info_
#define SAMG5_GET_CORRECT_CLUSTER_INFO samg5_get_correct_cluster_info_
#define SAMG5_SET_CSET_LASTPNT samg5_set_cset_lastpnt_
#define SAMG5_GET_CSET_LASTPNT samg5_get_cset_lastpnt_
#define SAMG5_SET_CSET_LESSVARS samg5_set_cset_lessvars_
#define SAMG5_GET_CSET_LESSVARS samg5_get_cset_lessvars_
#define SAMG5_SET_CSET_LONGROW samg5_set_cset_longrow_
#define SAMG5_GET_CSET_LONGROW samg5_get_cset_longrow_
#define SAMG5_ISET_CSET_READ samg5_iset_cset_read_
#define SAMG5_IGET_CSET_READ samg5_iget_cset_read_
#define SAMG5_SET_CSET_READ samg5_set_cset_read_
#define SAMG5_GET_CSET_READ samg5_get_cset_read_
#define SAMG5_SET_CSET_ZERODIAG samg5_set_cset_zerodiag_
#define SAMG5_GET_CSET_ZERODIAG samg5_get_cset_zerodiag_
#define SAMG5_SET_CSET_UNKNOWN samg5_set_cset_unknown_
#define SAMG5_GET_CSET_UNKNOWN samg5_get_cset_unknown_
#define SAMG5_SET_CSET_UNKNOWN1 samg5_set_cset_unknown1_
#define SAMG5_GET_CSET_UNKNOWN1 samg5_get_cset_unknown1_
#define SAMG5_SET_CSET_UNKNOWN2 samg5_set_cset_unknown2_
#define SAMG5_GET_CSET_UNKNOWN2 samg5_get_cset_unknown2_
#define SAMG5_SET_DELTA_MILU samg5_set_delta_milu_
#define SAMG5_GET_DELTA_MILU samg5_get_delta_milu_
#define SAMG5_SET_DENSX samg5_set_densx_
#define SAMG5_GET_DENSX samg5_get_densx_
#define SAMG5_SET_DIVERGENCE samg5_set_divergence_
#define SAMG5_GET_DIVERGENCE samg5_get_divergence_
#define SAMG5_SET_DIV_STOP_RULE samg5_set_div_stop_rule_
#define SAMG5_GET_DIV_STOP_RULE samg5_get_div_stop_rule_
#define SAMG5_SET_DIV_THRESHOLD samg5_set_div_threshold_
#define SAMG5_GET_DIV_THRESHOLD samg5_get_div_threshold_
#define SAMG5_SET_DROPTOL samg5_set_droptol_
#define SAMG5_GET_DROPTOL samg5_get_droptol_
#define SAMG5_SET_DROPTOL_CL samg5_set_droptol_cl_
#define SAMG5_GET_DROPTOL_CL samg5_get_droptol_cl_
#define SAMG5_SET_DROPTOL_2ND samg5_set_droptol_2nd_
#define SAMG5_GET_DROPTOL_2ND samg5_get_droptol_2nd_
#define SAMG5_SET_DROPTOL_SMO samg5_set_droptol_smo_
#define SAMG5_GET_DROPTOL_SMO samg5_get_droptol_smo_
#define SAMG5_SET_DUMP_APPROX_SOLUTION samg5_set_dump_approx_solution_
#define SAMG5_GET_DUMP_APPROX_SOLUTION samg5_get_dump_approx_solution_
#define SAMG5_SET_DUMP_CORRECTW samg5_set_dump_correctw_
#define SAMG5_GET_DUMP_CORRECTW samg5_get_dump_correctw_
#define SAMG5_SET_DUMP_GENERATED_SMOVEC samg5_set_dump_generated_smovec_
#define SAMG5_GET_DUMP_GENERATED_SMOVEC samg5_get_dump_generated_smovec_
#define SAMG5_SET_ECG samg5_set_ecg_
#define SAMG5_GET_ECG samg5_get_ecg_
#define SAMG5_SET_ECG_DEFAULT samg5_set_ecg_default_
#define SAMG5_GET_ECG_DEFAULT samg5_get_ecg_default_
#define SAMG5_SET_ICHOLESKY samg5_set_icholesky_
#define SAMG5_GET_ICHOLESKY samg5_get_icholesky_
#define SAMG5_SET_ENFORCE_FULLSMO samg5_set_enforce_fullsmo_
#define SAMG5_GET_ENFORCE_FULLSMO samg5_get_enforce_fullsmo_
#define SAMG5_SET_EPS_ABS samg5_set_eps_abs_
#define SAMG5_GET_EPS_ABS samg5_get_eps_abs_
#define SAMG5_SET_EPS_ACCEPT_JAC_UZAWA samg5_set_eps_accept_jac_uzawa_
#define SAMG5_GET_EPS_ACCEPT_JAC_UZAWA samg5_get_eps_accept_jac_uzawa_
#define SAMG5_SET_EPS_CONVERG_JAC_UZAWA samg5_set_eps_converg_jac_uzawa_
#define SAMG5_GET_EPS_CONVERG_JAC_UZAWA samg5_get_eps_converg_jac_uzawa_
#define SAMG5_SET_EPS_DD samg5_set_eps_dd_
#define SAMG5_GET_EPS_DD samg5_get_eps_dd_
#define SAMG5_SET_EPS_DIVERG_JAC_UZAWA samg5_set_eps_diverg_jac_uzawa_
#define SAMG5_GET_EPS_DIVERG_JAC_UZAWA samg5_get_eps_diverg_jac_uzawa_
#define SAMG5_SET_EPS_DIAG samg5_set_eps_diag_
#define SAMG5_GET_EPS_DIAG samg5_get_eps_diag_
#define SAMG5_SET_EPS_LSQ samg5_set_eps_lsq_
#define SAMG5_GET_EPS_LSQ samg5_get_eps_lsq_
#define SAMG5_SET_ETR samg5_set_etr_
#define SAMG5_GET_ETR samg5_get_etr_
#define SAMG5_SET_ETR_DEFAULT samg5_set_etr_default_
#define SAMG5_GET_ETR_DEFAULT samg5_get_etr_default_
#define SAMG5_SET_ETR2_SMO samg5_set_etr2_smo_
#define SAMG5_GET_ETR2_SMO samg5_get_etr2_smo_
#define SAMG5_SET_EWT samg5_set_ewt_
#define SAMG5_GET_EWT samg5_get_ewt_
#define SAMG5_SET_EWT_DEFAULT samg5_set_ewt_default_
#define SAMG5_GET_EWT_DEFAULT samg5_get_ewt_default_
#define SAMG5_SET_FACTOR_APP_VAR samg5_set_factor_app_var_
#define SAMG5_GET_FACTOR_APP_VAR samg5_get_factor_app_var_
#define SAMG5_SET_FACTOR_QUASI_RES samg5_set_factor_quasi_res_
#define SAMG5_GET_FACTOR_QUASI_RES samg5_get_factor_quasi_res_
#define SAMG5_SET_FACTOR_RES_VAR samg5_set_factor_res_var_
#define SAMG5_GET_FACTOR_RES_VAR samg5_get_factor_res_var_
#define SAMG5_SET_FACTOR_MATRIX_SCALE samg5_set_factor_matrix_scale_
#define SAMG5_GET_FACTOR_MATRIX_SCALE samg5_get_factor_matrix_scale_
#define SAMG5_SET_FACTOR_SOL_JAC_UZAWA samg5_set_factor_sol_jac_uzawa_
#define SAMG5_GET_FACTOR_SOL_JAC_UZAWA samg5_get_factor_sol_jac_uzawa_
#define SAMG5_ISET_FILNAM samg5_iset_filnam_
#define SAMG5_IGET_FILNAM samg5_iget_filnam_
#define SAMG5_SET_FILNAM samg5_set_filnam_
#define SAMG5_GET_FILNAM samg5_get_filnam_
#define SAMG5_ISET_FILNAM_DUMPSOL samg5_iset_filnam_dumpsol_
#define SAMG5_IGET_FILNAM_DUMPSOL samg5_iget_filnam_dumpsol_
#define SAMG5_SET_FILNAM_DUMPSOL samg5_set_filnam_dumpsol_
#define SAMG5_GET_FILNAM_DUMPSOL samg5_get_filnam_dumpsol_
#define SAMG5_ISET_FILNAM_DUMP samg5_iset_filnam_dump_
#define SAMG5_IGET_FILNAM_DUMP samg5_iget_filnam_dump_
#define SAMG5_SET_FILNAM_DUMP samg5_set_filnam_dump_
#define SAMG5_GET_FILNAM_DUMP samg5_get_filnam_dump_
#define SAMG5_ISET_FILNAM_UZAWA samg5_iset_filnam_uzawa_
#define SAMG5_IGET_FILNAM_UZAWA samg5_iget_filnam_uzawa_
#define SAMG5_SET_FILNAM_UZAWA samg5_set_filnam_uzawa_
#define SAMG5_GET_FILNAM_UZAWA samg5_get_filnam_uzawa_
#define SAMG5_SET_FLEX_PCG_LITE samg5_set_flex_pcg_lite_
#define SAMG5_GET_FLEX_PCG_LITE samg5_get_flex_pcg_lite_
#define SAMG5_SET_FORCE_ACCEL samg5_set_force_accel_
#define SAMG5_GET_FORCE_ACCEL samg5_get_force_accel_
#define SAMG5_SET_FORCE_ACCEL_2ND samg5_set_force_accel_2nd_
#define SAMG5_GET_FORCE_ACCEL_2ND samg5_get_force_accel_2nd_
#define SAMG5_SET_FULL_PIVOTING samg5_set_full_pivoting_
#define SAMG5_GET_FULL_PIVOTING samg5_get_full_pivoting_
#define SAMG5_SET_FULL_SETUP samg5_set_full_setup_
#define SAMG5_GET_FULL_SETUP samg5_get_full_setup_
#define SAMG5_SET_G_CMPLX_AGG_DEFAULT samg5_set_g_cmplx_agg_default_
#define SAMG5_GET_G_CMPLX_AGG_DEFAULT samg5_get_g_cmplx_agg_default_
#define SAMG5_SET_G_CMPLX_DEFAULT samg5_set_g_cmplx_default_
#define SAMG5_GET_G_CMPLX_DEFAULT samg5_get_g_cmplx_default_
#define SAMG5_SET_GALERKIN_TIMER samg5_set_galerkin_timer_
#define SAMG5_GET_GALERKIN_TIMER samg5_get_galerkin_timer_
#define SAMG5_SET_GLK_MULT_ZEROS samg5_set_glk_mult_zeros_
#define SAMG5_GET_GLK_MULT_ZEROS samg5_get_glk_mult_zeros_
#define SAMG5_SET_GMAX_MULTIPASS samg5_set_gmax_multipass_
#define SAMG5_GET_GMAX_MULTIPASS samg5_get_gmax_multipass_
#define SAMG5_SET_IAGGREGATION_PROFILE samg5_set_iaggregation_profile_
#define SAMG5_GET_IAGGREGATION_PROFILE samg5_get_iaggregation_profile_
#define SAMG5_SET_IAGGREGATION samg5_set_iaggregation_
#define SAMG5_GET_IAGGREGATION samg5_get_iaggregation_
#define SAMG5_SET_IALL_SMO samg5_set_iall_smo_
#define SAMG5_GET_IALL_SMO samg5_get_iall_smo_
#define SAMG5_SET_IAUTO_OMEGA_JACOBI samg5_set_iauto_omega_jacobi_
#define SAMG5_GET_IAUTO_OMEGA_JACOBI samg5_get_iauto_omega_jacobi_
#define SAMG5_SET_IAUTO_OMEGA_SMOAGG samg5_set_iauto_omega_smoagg_
#define SAMG5_GET_IAUTO_OMEGA_SMOAGG samg5_get_iauto_omega_smoagg_
#define SAMG5_SET_IAUTO_STOP samg5_set_iauto_stop_
#define SAMG5_GET_IAUTO_STOP samg5_get_iauto_stop_
#define SAMG5_SET_IDUMP_SEQUENCE_START samg5_set_idump_sequence_start_
#define SAMG5_GET_IDUMP_SEQUENCE_START samg5_get_idump_sequence_start_
#define SAMG5_SET_IDUMP_SEQUENCE_END samg5_set_idump_sequence_end_
#define SAMG5_GET_IDUMP_SEQUENCE_END samg5_get_idump_sequence_end_
#define SAMG5_SET_ISTAB_CG samg5_set_istab_cg_
#define SAMG5_GET_ISTAB_CG samg5_get_istab_cg_
#define SAMG5_SET_IELASTICITY_PROFILE samg5_set_ielasticity_profile_
#define SAMG5_GET_IELASTICITY_PROFILE samg5_get_ielasticity_profile_
#define SAMG5_SET_IELASTICITY samg5_set_ielasticity_
#define SAMG5_GET_IELASTICITY samg5_get_ielasticity_
#define SAMG5_SET_IESTIM_SPECT_RADIUS samg5_set_iestim_spect_radius_
#define SAMG5_GET_IESTIM_SPECT_RADIUS samg5_get_iestim_spect_radius_
#define SAMG5_SET_IESTIM_SMOOTH_NIT samg5_set_iestim_smooth_nit_
#define SAMG5_GET_IESTIM_SMOOTH_NIT samg5_get_iestim_smooth_nit_
#define SAMG5_SET_INIT_RES_TREATMENT samg5_set_init_res_treatment_
#define SAMG5_GET_INIT_RES_TREATMENT samg5_get_init_res_treatment_
#define SAMG5_SET_IPRNT_RES_ACCURACY samg5_set_iprnt_res_accuracy_
#define SAMG5_GET_IPRNT_RES_ACCURACY samg5_get_iprnt_res_accuracy_
#define SAMG5_SET_ISMO2DFL samg5_set_ismo2dfl_
#define SAMG5_GET_ISMO2DFL samg5_get_ismo2dfl_
#define SAMG5_SET_ISMOAGG_AGGRESSIVE samg5_set_ismoagg_aggressive_
#define SAMG5_GET_ISMOAGG_AGGRESSIVE samg5_get_ismoagg_aggressive_
#define SAMG5_SET_ISMOAGG_OVERCORRECTION samg5_set_ismoagg_overcorrection_
#define SAMG5_GET_ISMOAGG_OVERCORRECTION samg5_get_ismoagg_overcorrection_
#define SAMG5_SET_ISMOAGG_OPTIM samg5_set_ismoagg_optim_
#define SAMG5_GET_ISMOAGG_OPTIM samg5_get_ismoagg_optim_
#define SAMG5_SET_ISMOAGG_BLOCK_TYP samg5_set_ismoagg_block_typ_
#define SAMG5_GET_ISMOAGG_BLOCK_TYP samg5_get_ismoagg_block_typ_
#define SAMG5_SET_ISMOAGG_COMPRESSION samg5_set_ismoagg_compression_
#define SAMG5_GET_ISMOAGG_COMPRESSION samg5_get_ismoagg_compression_
#define SAMG5_SET_ISMOAGG_FILTER_TYP samg5_set_ismoagg_filter_typ_
#define SAMG5_GET_ISMOAGG_FILTER_TYP samg5_get_ismoagg_filter_typ_
#define SAMG5_SET_ISMOAGG_SMOOTH_TYP samg5_set_ismoagg_smooth_typ_
#define SAMG5_GET_ISMOAGG_SMOOTH_TYP samg5_get_ismoagg_smooth_typ_
#define SAMG5_SET_ISMOAGG_SMOOTH_NIT samg5_set_ismoagg_smooth_nit_
#define SAMG5_GET_ISMOAGG_SMOOTH_NIT samg5_get_ismoagg_smooth_nit_
#define SAMG5_SET_ISMOAGG_SMOOTH_1LEV samg5_set_ismoagg_smooth_1lev_
#define SAMG5_GET_ISMOAGG_SMOOTH_1LEV samg5_get_ismoagg_smooth_1lev_
#define SAMG5_SET_ISMOAGG_SMOOTH_NLEV samg5_set_ismoagg_smooth_nlev_
#define SAMG5_GET_ISMOAGG_SMOOTH_NLEV samg5_get_ismoagg_smooth_nlev_
#define SAMG5_SET_IB_CMPLX samg5_set_ib_cmplx_
#define SAMG5_GET_IB_CMPLX samg5_get_ib_cmplx_
#define SAMG5_SET_IB_CMPLX_AGG_DEFAULT samg5_set_ib_cmplx_agg_default_
#define SAMG5_GET_IB_CMPLX_AGG_DEFAULT samg5_get_ib_cmplx_agg_default_
#define SAMG5_SET_IB_CMPLX_DEFAULT samg5_set_ib_cmplx_default_
#define SAMG5_GET_IB_CMPLX_DEFAULT samg5_get_ib_cmplx_default_
#define SAMG5_SET_IBGS_PIVOT samg5_set_ibgs_pivot_
#define SAMG5_GET_IBGS_PIVOT samg5_get_ibgs_pivot_
#define SAMG5_SET_ICASE_JAC_UZAWA samg5_set_icase_jac_uzawa_
#define SAMG5_GET_ICASE_JAC_UZAWA samg5_get_icase_jac_uzawa_
#define SAMG5_SET_ISTATISTICS_SMOVEC samg5_set_istatistics_smovec_
#define SAMG5_GET_ISTATISTICS_SMOVEC samg5_get_istatistics_smovec_
#define SAMG5_SET_ICHECK_SMOINT samg5_set_icheck_smoint_
#define SAMG5_GET_ICHECK_SMOINT samg5_get_icheck_smoint_
#define SAMG5_SET_ICOLOR_OMP samg5_set_icolor_omp_
#define SAMG5_GET_ICOLOR_OMP samg5_get_icolor_omp_
#define SAMG5_SET_IORDERED_OMP samg5_set_iordered_omp_
#define SAMG5_GET_IORDERED_OMP samg5_get_iordered_omp_
#define SAMG5_SET_ICRITS samg5_set_icrits_
#define SAMG5_GET_ICRITS samg5_get_icrits_
#define SAMG5_SET_IDTEST_UZAWA samg5_set_idtest_uzawa_
#define SAMG5_GET_IDTEST_UZAWA samg5_get_idtest_uzawa_
#define SAMG5_SET_IHUGE samg5_set_ihuge_
#define SAMG5_GET_IHUGE samg5_get_ihuge_
#define SAMG5_SET_IJAC_UZAWA samg5_set_ijac_uzawa_
#define SAMG5_GET_IJAC_UZAWA samg5_get_ijac_uzawa_
#define SAMG5_SET_ILU4ALLSCHWARZ samg5_set_ilu4allschwarz_
#define SAMG5_GET_ILU4ALLSCHWARZ samg5_get_ilu4allschwarz_
#define SAMG5_SET_ILU_SPEED samg5_set_ilu_speed_
#define SAMG5_GET_ILU_SPEED samg5_get_ilu_speed_
#define SAMG5_SET_IMPLDO_READ_WRITE_LEN samg5_set_impldo_read_write_len_
#define SAMG5_GET_IMPLDO_READ_WRITE_LEN samg5_get_impldo_read_write_len_
#define SAMG5_SET_INFO_KEEPMEM samg5_set_info_keepmem_
#define SAMG5_GET_INFO_KEEPMEM samg5_get_info_keepmem_
#define SAMG5_SET_INNER_ACCEL samg5_set_inner_accel_
#define SAMG5_GET_INNER_ACCEL samg5_get_inner_accel_
#define SAMG5_SET_IODUMP samg5_set_iodump_
#define SAMG5_GET_IODUMP samg5_get_iodump_
#define SAMG5_ISET_IOFILE_OPTA samg5_iset_iofile_opta_
#define SAMG5_IGET_IOFILE_OPTA samg5_iget_iofile_opta_
#define SAMG5_SET_IOFILE_OPTA samg5_set_iofile_opta_
#define SAMG5_GET_IOFILE_OPTA samg5_get_iofile_opta_
#define SAMG5_ISET_IOFORM samg5_iset_ioform_
#define SAMG5_IGET_IOFORM samg5_iget_ioform_
#define SAMG5_SET_IOFORM samg5_set_ioform_
#define SAMG5_GET_IOFORM samg5_get_ioform_
#define SAMG5_SET_IOGRID samg5_set_iogrid_
#define SAMG5_GET_IOGRID samg5_get_iogrid_
#define SAMG5_SET_IOMOVIE samg5_set_iomovie_
#define SAMG5_GET_IOMOVIE samg5_get_iomovie_
#define SAMG5_SET_IOSCRATCH_DEFAULT samg5_set_ioscratch_default_
#define SAMG5_GET_IOSCRATCH_DEFAULT samg5_get_ioscratch_default_
#define SAMG5_SET_IOUNIT_OPTA samg5_set_iounit_opta_
