openCSMP/openCSMP/lib/samg/samg5.h
SAMG_C_CALLCONV SAMG5_GET_ITRACE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_SMOAGG_NOQR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_SMOAGG_NOQR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_STACKTRACE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_STACKTRACE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_STORE_PGS_FACTOR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_STORE_PGS_FACTOR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_KCYCLE_PROFILE(double *dval);
SAMG_C_CALLCONV SAMG5_GET_KCYCLE_PROFILE(double *dval);
SAMG_C_CALLCONV SAMG5_SET_KEEPMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_KEEPMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_K_DISABLE_KRYLOV1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_K_DISABLE_KRYLOV1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_K_DYNCYC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_K_DYNCYC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LASTGRID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LASTGRID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LEV_COARSENING_TOO_SLOW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LEV_COARSENING_TOO_SLOW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LEVELS_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LEVELS_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LEVELX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LEVELX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LEVELX_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LEVELX_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LFIL_CL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LFIL_CL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LFIL_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LFIL_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LFIL_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LFIL_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_ISET_LOGFILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_LOGFILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_LOGFILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_LOGFILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_LOGIO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LOGIO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_LU_REUSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_LU_REUSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MATRIX_MODE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MATRIX_MODE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MATRIX_FORMAT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MATRIX_FORMAT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MATRIX_SCALE_RENORM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MATRIX_SCALE_RENORM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAX_CALLS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAX_CALLS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAX_CL_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAX_CL_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAXCORR_CLUSTER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAXCORR_CLUSTER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAX_LEVEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAX_LEVEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAX_NB_LIST_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAX_NB_LIST_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAXITER_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAXITER_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAXOP_RESTART(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAXOP_RESTART(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MAXRETRY_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MAXRETRY_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MILU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MILU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MIN_CL_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MIN_CL_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MIN_MULTI_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MIN_MULTI_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MINITER_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MINITER_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MK_REGULAR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MK_REGULAR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MODE_CNTRL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MODE_CNTRL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MODE_DEBUG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MODE_DEBUG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MODE_MESS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MODE_MESS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MODIFY_MAT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MODIFY_MAT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MODIFY_RESTRICTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MODIFY_RESTRICTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_MULTIPASS_ALLCOUP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_MULTIPASS_ALLCOUP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_DEBUG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_DEBUG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_MAX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_MAX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_OVERLAP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_OVERLAP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_RESID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_RESID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_SOLVE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_SOLVE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBLK_SOLVER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBLK_SOLVER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBND_OMEGA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBND_OMEGA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBND_OMEGA_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBND_OMEGA_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBND_SWEEPS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBND_SWEEPS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NBND_SWEEPS_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NBND_SWEEPS_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCOLOR_BLOCK_GS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCOLOR_BLOCK_GS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCOLOR_BLOCK_GS_MSG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCOLOR_BLOCK_GS_MSG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCOLOR_BLOCK_GS_RESCHK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCOLOR_BLOCK_GS_RESCHK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NDEGREE_CHEBY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NDEGREE_CHEBY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCFRAMES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCFRAMES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCGRAD_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCGRAD_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCYC_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCYC_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCYC_MIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCYC_MIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCYC_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCYC_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NCYC_START(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NCYC_START(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NDYN_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NDYN_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NEG_DIAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NEG_DIAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NEG_DIAG_BRUTE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NEG_DIAG_BRUTE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NEW_ENTRIES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NEW_ENTRIES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NEW_TOPOLOGY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NEW_TOPOLOGY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NILU_REORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NILU_REORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NINCR_RES_ACCEPTED_MG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NINCR_RES_ACCEPTED_MG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NINCR_RES_ACCEPTED_1G(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NINCR_RES_ACCEPTED_1G(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NINT_ROWSUM1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NINT_ROWSUM1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NINTER_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NINTER_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NITER_SKIP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NITER_SKIP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NKCYCLE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NKCYCLE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NKDIM_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NKDIM_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSMOOTH_COO_POLY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSMOOTH_COO_POLY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSMOAGG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSMOAGG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSMOAGG1LEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSMOAGG1LEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSMOAGGLEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSMOAGGLEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NMIN_MATRIX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NMIN_MATRIX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NMIN_MATRIX_RESC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NMIN_MATRIX_RESC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NMIN_VECTOR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NMIN_VECTOR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NOTALLUNS_CHEAP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NOTALLUNS_CHEAP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NP_MOD1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NP_MOD1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NP_MOD2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NP_MOD2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NP_OPT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NP_OPT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NPRIM_AT_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NPRIM_AT_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NPTMAX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NPTMAX(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NPTMN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NPTMN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRC_EMERGENCY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRC_EMERGENCY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRD_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRD_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NRU_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NRU_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSIMPLE_EMERGENCY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSIMPLE_EMERGENCY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSOLVE_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSOLVE_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSOLVE_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSOLVE_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSOLVE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSOLVE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSTAR_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSTAR_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSW_OMEGA_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSW_OMEGA_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NSW_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NSW_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTAKE_RES_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTAKE_RES_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTH_RES_SCRATCH(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTH_RES_SCRATCH(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTR_PRIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTR_PRIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTYP_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTYP_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NTYP_GALERKIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NTYP_GALERKIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NUMTRY_MAX_SET(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NUMTRY_MAX_SET(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NVERSION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NVERSION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NWT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NWT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_NXTYP_COARSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_NXTYP_COARSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OIL_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OIL_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OIL_GPRS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OIL_GPRS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OIL_NOPRIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OIL_NOPRIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_JAC_ES_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_JAC_ES_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_JAC_P_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_JAC_P_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_JACOBI(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_JACOBI(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_SOR_DO(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_SOR_DO(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_SOR_UP(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_SOR_UP(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_SMO(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_SMO(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_SMO_MIN(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_SMO_MIN(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMEGA_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_GET_OMEGA_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_SET_OMP_ILU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OMP_ILU(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_ISET_OMP_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_OMP_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_OMP_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_OMP_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_OMP_NUM_THREADS_EXTERNAL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OMP_NUM_THREADS_EXTERNAL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OMP_NTHREADS_ONLY4SPLIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OMP_NTHREADS_ONLY4SPLIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OMP_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OMP_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_OPT_MATRIX_OPS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_OPT_MATRIX_OPS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_P_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_GET_P_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_SET_P_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_GET_P_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_SET_PARTIAL_FRAC(double *dval);
SAMG_C_CALLCONV SAMG5_GET_PARTIAL_FRAC(double *dval);
SAMG_C_CALLCONV SAMG5_ISET_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_AMG_RENUMBER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_AMG_RENUMBER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_ISET_AMG_RENUMBER_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_AMG_RENUMBER_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_AMG_RENUMBER_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_AMG_RENUMBER_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_ISET_DUMPFILE_RENUMBER(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_DUMPFILE_RENUMBER(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_DUMPFILE_RENUMBER(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_DUMPFILE_RENUMBER(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_PERF_METER_ENABLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PERF_METER_ENABLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_PRIM_NORM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PRIM_NORM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_PRIM_PRINT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PRIM_PRINT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_PRINT_NXTYP_COARSE_MSG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PRINT_NXTYP_COARSE_MSG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_PRINT_SETUP_ILU_OR_DIRECT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PRINT_SETUP_ILU_OR_DIRECT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_PRNT_STAT_SCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_PRNT_STAT_SCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_QUASI_ONLY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_QUASI_ONLY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_REDUCT_KCYCLE(double *dval);
SAMG_C_CALLCONV SAMG5_GET_REDUCT_KCYCLE(double *dval);
SAMG_C_CALLCONV SAMG5_SET_RBM_INTERN_INFO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_RBM_INTERN_INFO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_RCONDX(double *dval);
SAMG_C_CALLCONV SAMG5_GET_RCONDX(double *dval);
SAMG_C_CALLCONV SAMG5_SET_READ_UZAWA_PARMS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_READ_UZAWA_PARMS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_READ_MARIAN_COARSENING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_READ_MARIAN_COARSENING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_REFRESH_CALLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_REFRESH_CALLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_REL_APP_VAR(double *dval);
SAMG_C_CALLCONV SAMG5_GET_REL_APP_VAR(double *dval);
SAMG_C_CALLCONV SAMG5_SET_RHO_MIN(double *dval);
SAMG_C_CALLCONV SAMG5_GET_RHO_MIN(double *dval);
SAMG_C_CALLCONV SAMG5_SET_RHO_OK(double *dval);
SAMG_C_CALLCONV SAMG5_GET_RHO_OK(double *dval);
SAMG_C_CALLCONV SAMG5_SET_SHOW_UN_RES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_SHOW_UN_RES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_ISET_SCRATCHFILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_IGET_SCRATCHFILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_SCRATCHFILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_GET_SCRATCHFILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG5_SET_SLOW_COARSENING(double *dval);
SAMG_C_CALLCONV SAMG5_GET_SLOW_COARSENING(double *dval);
SAMG_C_CALLCONV SAMG5_SET_STABILITY(double *dval);
SAMG_C_CALLCONV SAMG5_GET_STABILITY(double *dval);
SAMG_C_CALLCONV SAMG5_SET_STRUCT_IDENT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_STRUCT_IDENT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_STRUCT_SYMM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_STRUCT_SYMM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_TAU_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_GET_TAU_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG5_SET_TERM_COARSENING(double *dval);
SAMG_C_CALLCONV SAMG5_GET_TERM_COARSENING(double *dval);
SAMG_C_CALLCONV SAMG5_SET_TRACE_L2_QUASI_RES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_TRACE_L2_QUASI_RES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_TRACKMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_TRACKMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_TRACKRESID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_TRACKRESID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_TRACK_AP_P(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_TRACK_AP_P(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_USE_IC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_USE_IC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_VIO_DD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_VIO_DD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_W_AVRGE_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_GET_W_AVRGE_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_SET_W_AVRGE_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_GET_W_AVRGE_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG5_SET_WCOUPLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_WCOUPLED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_WFT(double *dval);
SAMG_C_CALLCONV SAMG5_GET_WFT(double *dval);
SAMG_C_CALLCONV SAMG5_SET_WLEN_SWITCHES_GALERKIN(double *dval);
SAMG_C_CALLCONV SAMG5_GET_WLEN_SWITCHES_GALERKIN(double *dval);
SAMG_C_CALLCONV SAMG5_SET_WRITE_CLUSTER_ID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_GET_WRITE_CLUSTER_ID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG5_SET_WTSL(double *dval);
SAMG_C_CALLCONV SAMG5_GET_WTSL(double *dval);
}

